FARLY7/xcan-router/ECU_Cluster_01/ECU_Cluster_01_Z4_0/Project_Settings/Startup_Code/startup_MPC5748G.S
#if defined(I_CACHE) && (ICACHE_ENABLE == 1)
;#****************** Invalidate and Enable the Instruction cache **************
__icache_cfg:
    e_li     r5, 0x2
    mtspr    1011, r5

    e_li     r7, 0x4
    e_li     r8, 0x2
    e_lis    r11, 0xFFFF
    e_or2i   r11, 0xFFFB

__icache_inv:
    mfspr    r9, 1011
    and.     r10, r7, r9
    e_beq    __icache_no_abort
    and.     r10, r11, r9
    mtspr    1011, r10
    e_b      __icache_cfg

__icache_no_abort:
    and.     r10, r8, r9
    e_bne    __icache_inv

    mfspr    r5, 1011
    e_ori    r5, r5, 0x0001
    se_isync
    mtspr    1011, r5
#endif

#if defined(D_CACHE) && (DCACHE_ENABLE == 1)
;#****************** Invalidate and Enable the Data cache **************
__dcache_cfg:
    e_li r5, 0x2
    mtspr 1010, r5

    e_li r7, 0x4
    e_li r8, 0x2
    e_lis    r11, 0xFFFF
    e_or2i   r11, 0xFFFB

__dcache_inv:
    mfspr r9, 1010
    and.  r10, r7, r9
    e_beq   __dcache_no_abort
    and.  r10, r11, r9
    mtspr 1010, r10
    e_b __dcache_cfg

__dcache_no_abort:
    and.  r10, r8, r9
    e_bne __dcache_inv

    mfspr r5, 1010
    e_ori   r5, r5, 0x0001
    se_isync
    msync
    mtspr 1010, r5
#endif


;#****************************** Configure Stack *****************************
    e_lis       r1, __SP_INIT@h         ;# Initialize stack pointer r1 to
    e_or2i      r1, __SP_INIT@l         ;# value in linker command file.

    e_lis       r13, _SDA_BASE_@h       ;# Initialize r13 to sdata base
    e_or2i      r13, _SDA_BASE_@l       ;# (provided by linker).

    e_lis       r2, _SDA2_BASE_@h       ;# Initialize r2 to sdata2 base
    e_or2i      r2, _SDA2_BASE_@l       ;# (provided by linker).

    e_stwu      r0, -64(r1)             ;# Terminate stack.

#ifndef __NO_SYSTEM_INIT
;# Call the system init routine
    e_bl   SystemInit
#endif
;# Init .data and .bss sections
    e_bl   init_data_bss
    wrteei 1    ;# Enable interrupts
;# Jump to Main
    e_bl        main

    .section .intc_vector_table, "a"
    .align 2
    .globl __isr_vector
__isr_vector:
    .long   DefaultISR                       /* Vector #   0 Software setable flag 0 SSCIR0[CLR0] */
    .long   DefaultISR                       /* Vector #   1 Software setable flag 1 SSCIR0[CLR1] */
    .long   DefaultISR                       /* Vector #   2 Software setable flag 2 SSCIR0[CLR2] */
    .long   DefaultISR                       /* Vector #   3 Software setable flag 3 SSCIR0[CLR3] */
    .long   DefaultISR                       /* Vector #   4 Software setable flag 4 SSCIR0[CLR4] */
    .long   DefaultISR                       /* Vector #   5 Software setable flag 5 SSCIR0[CLR5] */
    .long   DefaultISR                       /* Vector #   6 Software setable flag 6 SSCIR0[CLR6] */
    .long   DefaultISR                       /* Vector #   7 Software setable flag 7 SSCIR0[CLR7] */
    .long   DefaultISR                       /* Vector #   8 Software setable flag 8 SSCIR0[CLR8] */
    .long   DefaultISR                       /* Vector #   9 Software setable flag 9 SSCIR0[CLR9] */
    .long   DefaultISR                       /* Vector #  10 Software setable flag 10 SSCIR0[CLR10] */
    .long   DefaultISR                       /* Vector #  11 Software setable flag 11 SSCIR0[CLR11] */
    .long   DefaultISR                       /* Vector #  12 Software setable flag 12 SSCIR0[CLR12] */
    .long   DefaultISR                       /* Vector #  13 Software setable flag 13 SSCIR0[CLR13] */
    .long   DefaultISR                       /* Vector #  14 Software setable flag 14 SSCIR0[CLR14] */
    .long   DefaultISR                       /* Vector #  15 Software setable flag 15 SSCIR0[CLR15] */
    .long   DefaultISR                       /* Vector #  16 Software setable flag 16 SSCIR0[CLR16] */
    .long   DefaultISR                       /* Vector #  17 Software setable flag 17 SSCIR0[CLR17] */
    .long   DefaultISR                       /* Vector #  18 Software setable flag 18 SSCIR0[CLR18] */
    .long   DefaultISR                       /* Vector #  19 Software setable flag 19 SSCIR0[CLR19] */
    .long   DefaultISR                       /* Vector #  20 Software setable flag 20 SSCIR0[CLR20] */
    .long   DefaultISR                       /* Vector #  21 Software setable flag 21 SSCIR0[CLR21] */
    .long   DefaultISR                       /* Vector #  22 Software setable flag 22 SSCIR0[CLR22] */
    .long   DefaultISR                       /* Vector #  23 Software setable flag 23 SSCIR0[CLR23] */
    .long   DefaultISR                       /* Vector #  24 */
    .long   DefaultISR                       /* Vector #  25 */
    .long   DefaultISR                       /* Vector #  26 */
    .long   DefaultISR                       /* Vector #  27 */
    .long   DefaultISR                       /* Vector #  28 */
    .long   DefaultISR                       /* Vector #  29 */
    .long   DefaultISR                       /* Vector #  30 */
    .long   DefaultISR                       /* Vector #  31 */
    .long   SWT0_IRQHandler                  /* Vector #  32 Platform watchdog timer0 SWT_0_IR[TIF] */
    .long   SWT1_IRQHandler                  /* Vector #  33 Platform watchdog timer1 SWT_1_IR[TIF] */
    .long   SWT2_IRQHandler                  /* Vector #  34 Platform watchdog timer2 SWT_2_IR[TIF] */
    .long   DefaultISR                       /* Vector #  35 */
    .long   STM0_Ch0_IRQHandler              /* Vector #  36 On-Platform periodic timer 0_0 (STM) STM_0_CIR0[CIF] */
    .long   STM0_Ch1_IRQHandler              /* Vector #  37 On-Platform periodic timer 0_1 (STM) STM_0_CIR1[CIF] */
    .long   STM0_Ch2_IRQHandler              /* Vector #  38 On-Platform periodic timer 0_2 (STM) STM_0_CIR2[CIF] */
    .long   STM0_Ch3_IRQHandler              /* Vector #  39 On-Platform periodic timer 0_3 (STM) STM_0_CIR3[CIF] */
    .long   STM1_Ch0_IRQHandler              /* Vector #  40 On-Platform periodic timer 1_0 (STM) STM_1_CIR0[CIF] */
    .long   STM1_Ch1_IRQHandler              /* Vector #  41 On-Platform periodic timer 1_1 (STM) STM_1_CIR1[CIF] */
    .long   STM1_Ch2_IRQHandler              /* Vector #  42 On-Platform periodic timer 1_2 (STM) STM_1_CIR2[CIF] */
    .long   STM1_Ch3_IRQHandler              /* Vector #  43 On-Platform periodic timer 1_3 (STM) STM_1_CIR3[CIF] */
    .long   STM2_Ch0_IRQHandler              /* Vector #  44 On-Platform periodic timer 2_0 (STM) STM_2_CIR0[CIF] */
    .long   STM2_Ch1_IRQHandler              /* Vector #  45 On-Platform periodic timer 2_1 (STM) STM_2_CIR1[CIF] */
    .long   STM2_Ch2_IRQHandler              /* Vector #  46 On-Platform periodic timer 2_2 (STM) STM_2_CIR2[CIF] */
    .long   STM2_Ch3_IRQHandler              /* Vector #  47 On-Platform periodic timer 2_3 (STM) STM_2_CIR3[CIF] */
    .long   DefaultISR                       /* Vector #  48 */
    .long   DefaultISR                       /* Vector #  49 */
    .long   DefaultISR                       /* Vector #  50 */
    .long   DefaultISR                       /* Vector #  51 */
    .long   DMA_Error_IRQHandler             /* Vector #  52 eDMA Combined Error eDMA Channel Error Flags 63-0 */
    .long   DMA0_IRQHandler                  /* Vector #  53 eDMA Channel 0 DMA_INTL[INT0] */
    .long   DMA1_IRQHandler                  /* Vector #  54 eDMA Channel 1 DMA_INTL[INT1] */
    .long   DMA2_IRQHandler                  /* Vector #  55 eDMA Channel 2 DMA_INTL[INT2] */
    .long   DMA3_IRQHandler                  /* Vector #  56 eDMA Channel 3 DMA_INTL[INT3] */
    .long   DMA4_IRQHandler                  /* Vector #  57 eDMA Channel 4 DMA_INTL[INT4] */
    .long   DMA5_IRQHandler                  /* Vector #  58 eDMA Channel 5 DMA_INTL[INT5] */
    .long   DMA6_IRQHandler                  /* Vector #  59 eDMA Channel 6 DMA_INTL[INT6] */
    .long   DMA7_IRQHandler                  /* Vector #  60 eDMA Channel 7 DMA_INTL[INT7] */
    .long   DMA8_IRQHandler                  /* Vector #  61 eDMA Channel 8 DMA_INTL[INT8] */
    .long   DMA9_IRQHandler                  /* Vector #  62 eDMA Channel 9 DMA_INTL[INT9] */
    .long   DMA10_IRQHandler                 /* Vector #  63 eDMA Channel 10 DMA_INTL[INT10] */
    .long   DMA11_IRQHandler                 /* Vector #  64 eDMA Channel 11 DMA_INTL[INT11] */
    .long   DMA12_IRQHandler                 /* Vector #  65 eDMA Channel 12 DMA_INTL[INT12] */
    .long   DMA13_IRQHandler                 /* Vector #  66 eDMA Channel 13 DMA_INTL[INT13] */
    .long   DMA14_IRQHandler                 /* Vector #  67 eDMA Channel 14 DMA_INTL[INT14] */
    .long   DMA15_IRQHandler                 /* Vector #  68 eDMA Channel 15 DMA_INTL[INT15] */
    .long   DMA16_IRQHandler                 /* Vector #  69 eDMA Channel 16 DMA_INTL[INT16] */
    .long   DMA17_IRQHandler                 /* Vector #  70 eDMA Channel 17 DMA_INTL[INT17] */
    .long   DMA18_IRQHandler                 /* Vector #  71 eDMA Channel 18 DMA_INTL[INT18] */
    .long   DMA19_IRQHandler                 /* Vector #  72 eDMA Channel 19 DMA_INTL[INT19] */
    .long   DMA20_IRQHandler                 /* Vector #  73 eDMA Channel 20 DMA_INTL[INT20] */
    .long   DMA21_IRQHandler                 /* Vector #  74 eDMA Channel 21 DMA_INTL[INT21] */
    .long   DMA22_IRQHandler                 /* Vector #  75 eDMA Channel 22 DMA_INTL[INT22] */
    .long   DMA23_IRQHandler                 /* Vector #  76 eDMA Channel 23 DMA_INTL[INT23] */
    .long   DMA24_IRQHandler                 /* Vector #  77 eDMA Channel 24 DMA_INTL[INT24] */
    .long   DMA25_IRQHandler                 /* Vector #  78 eDMA Channel 25 DMA_INTL[INT25] */
    .long   DMA26_IRQHandler                 /* Vector #  79 eDMA Channel 26 DMA_INTL[INT26] */
    .long   DMA27_IRQHandler                 /* Vector #  80 eDMA Channel 27 DMA_INTL[INT27] */
    .long   DMA28_IRQHandler                 /* Vector #  81 eDMA Channel 28 DMA_INTL[INT28] */
    .long   DMA29_IRQHandler                 /* Vector #  82 eDMA Channel 29 DMA_INTL[INT29] */
    .long   DMA30_IRQHandler                 /* Vector #  83 eDMA Channel 30 DMA_INTL[INT30] */
    .long   DMA31_IRQHandler                 /* Vector #  84 eDMA Channel 31 DMA_INTL[INT31] */
    .long   DefaultISR                       /* Vector #  85 */
    .long   DefaultISR                       /* Vector #  86 */
    .long   DefaultISR                       /* Vector #  87 */
    .long   DefaultISR                       /* Vector #  88 */
    .long   DefaultISR                       /* Vector #  89 */
    .long   DefaultISR                       /* Vector #  90 */
    .long   DefaultISR                       /* Vector #  91 */
    .long   DefaultISR                       /* Vector #  92 */
    .long   DefaultISR                       /* Vector #  93 */
    .long   DefaultISR                       /* Vector #  94 */
    .long   DefaultISR                       /* Vector #  95 */
    .long   DefaultISR                       /* Vector #  96 */
    .long   DefaultISR                       /* Vector #  97 */
    .long   DefaultISR                       /* Vector #  98 */
    .long   DefaultISR                       /* Vector #  99 */
    .long   DefaultISR                       /* Vector # 100 */
    .long   DefaultISR                       /* Vector # 101 */
    .long   DefaultISR                       /* Vector # 102 */
    .long   DefaultISR                       /* Vector # 103 */
    .long   DefaultISR                       /* Vector # 104 */
    .long   DefaultISR                       /* Vector # 105 */
    .long   DefaultISR                       /* Vector # 106 */
    .long   DefaultISR                       /* Vector # 107 */
    .long   DefaultISR                       /* Vector # 108 */
    .long   DefaultISR                       /* Vector # 109 */
    .long   DefaultISR                       /* Vector # 110 */
    .long   DefaultISR                       /* Vector # 111 */
    .long   DefaultISR                       /* Vector # 112 */
    .long   DefaultISR                       /* Vector # 113 */
    .long   DefaultISR                       /* Vector # 114 */
    .long   DefaultISR                       /* Vector # 115 */
    .long   DefaultISR                       /* Vector # 116 */
    .long   DefaultISR                       /* Vector # 117 */
    .long   DefaultISR                       /* Vector # 118 */
    .long   DefaultISR                       /* Vector # 119 */
    .long   DefaultISR                       /* Vector # 120 */
    .long   DefaultISR                       /* Vector # 121 */
    .long   DefaultISR                       /* Vector # 122 */
    .long   DefaultISR                       /* Vector # 123 */
    .long   DefaultISR                       /* Vector # 124 */
    .long   DefaultISR                       /* Vector # 125 */
    .long   DefaultISR                       /* Vector # 126 */
    .long   DefaultISR                       /* Vector # 127 */
    .long   DefaultISR                       /* Vector # 128 */
    .long   DefaultISR                       /* Vector # 129 */
    .long   DefaultISR                       /* Vector # 130 */
    .long   DefaultISR                       /* Vector # 131 */
    .long   DefaultISR                       /* Vector # 132 */
    .long   DefaultISR                       /* Vector # 133 */
    .long   DefaultISR                       /* Vector # 134 */
    .long   DefaultISR                       /* Vector # 135 */
    .long   DefaultISR                       /* Vector # 136 */
    .long   DefaultISR                       /* Vector # 137 */
    .long   DefaultISR                       /* Vector # 138 */
    .long   DefaultISR                       /* Vector # 139 */
    .long   DefaultISR                       /* Vector # 140 */
    .long   DefaultISR                       /* Vector # 141 */
    .long   DefaultISR                       /* Vector # 142 */
    .long   DefaultISR                       /* Vector # 143 */
    .long   DefaultISR                       /* Vector # 144 */
    .long   DefaultISR                       /* Vector # 145 */
    .long   DefaultISR                       /* Vector # 146 */
    .long   DefaultISR                       /* Vector # 147 */
    .long   DefaultISR                       /* Vector # 148 */
    .long   DefaultISR                       /* Vector # 149 */
    .long   DefaultISR                       /* Vector # 150 */
    .long   DefaultISR                       /* Vector # 151 */
    .long   DefaultISR                       /* Vector # 152 */
    .long   DefaultISR                       /* Vector # 153 */
    .long   DefaultISR                       /* Vector # 154 */
    .long   DefaultISR                       /* Vector # 155 */
    .long   DefaultISR                       /* Vector # 156 */
    .long   DefaultISR                       /* Vector # 157 */
    .long   DefaultISR                       /* Vector # 158 */
    .long   DefaultISR                       /* Vector # 159 */
    .long   DefaultISR                       /* Vector # 160 */
    .long   DefaultISR                       /* Vector # 161 */
    .long   DefaultISR                       /* Vector # 162 */
    .long   DefaultISR                       /* Vector # 163 */
    .long   DefaultISR                       /* Vector # 164 */
    .long   DefaultISR                       /* Vector # 165 */
    .long   DefaultISR                       /* Vector # 166 */
    .long   DefaultISR                       /* Vector # 167 */
    .long   DefaultISR                       /* Vector # 168 */
    .long   DefaultISR                       /* Vector # 169 */
    .long   DefaultISR                       /* Vector # 170 */
    .long   DefaultISR                       /* Vector # 171 */
    .long   DefaultISR                       /* Vector # 172 */
    .long   DefaultISR                       /* Vector # 173 */
    .long   DefaultISR                       /* Vector # 174 */
    .long   DefaultISR                       /* Vector # 175 */
    .long   DefaultISR                       /* Vector # 176 */
    .long   DefaultISR                       /* Vector # 177 */
    .long   DefaultISR                       /* Vector # 178 */
    .long   DefaultISR                       /* Vector # 179 */
    .long   DefaultISR                       /* Vector # 180 */
    .long   DefaultISR                       /* Vector # 181 */
    .long   DefaultISR                       /* Vector # 182 */
    .long   DefaultISR                       /* Vector # 183 */
    .long   DefaultISR                       /* Vector # 184 */
    .long   FLASH_Done_IRQHandler            /* Vector # 185 Flash controller Prog/Erase/Suspend IRQ_0 MCR[DONE] */
    .long   DefaultISR                       /* Vector # 186 */
    .long   DefaultISR                       /* Vector # 187 */
    .long   DefaultISR                       /* Vector # 188 */
    .long   DefaultISR                       /* Vector # 189 */
    .long   DefaultISR                       /* Vector # 190 */
    .long   DefaultISR                       /* Vector # 191 */
    .long   DefaultISR                       /* Vector # 192 */
    .long   DefaultISR                       /* Vector # 193 */
    .long   DefaultISR                       /* Vector # 194 */
    .long   DefaultISR                       /* Vector # 195 */
    .long   DefaultISR                       /* Vector # 196 */
    .long   DefaultISR                       /* Vector # 197 */
    .long   DefaultISR                       /* Vector # 198 */
    .long   DefaultISR                       /* Vector # 199 */
    .long   DefaultISR                       /* Vector # 200 */
    .long   ENET1_Err_IRQHandler             /* Vector # 201 ENET1 Interrupt Group0 ENET_0 */
    .long   ENET1_Rx_IRQHandler              /* Vector # 202 ENET1 Interrupt Group1 ENET_1 */
    .long   ENET1_Tx_IRQHandler              /* Vector # 203 ENET1 Interrupt Group2 ENET_2 */
    .long   ENET1_Parser_IRQHandler          /* Vector # 204 ENET1 Interrupt Group3 ENET_3 */
    .long   ENET1_Timer_IRQHandler           /* Vector # 205 ENET1 Interrupt Group4 ENET_4 */
    .long   ENET1_Rx_1_IRQHandler            /* Vector # 206 ENET1 Interrupt Group5 ENET_5 */
    .long   ENET1_Tx_1_IRQHandler            /* Vector # 207 ENET1 Interrupt Group6 ENET_6 */
    .long   ENET1_Rx_2_IRQHandler            /* Vector # 208 ENET1 Interrupt Group7 ENET_7 */
    .long   ENET1_Tx_2_IRQHandler            /* Vector # 209 ENET1 Interrupt Group8 ENET_8 */
    .long   ENET0_Err_IRQHandler             /* Vector # 210 ENET0 Interrupt Group0 ENET_0 */
    .long   ENET0_Rx_IRQHandler              /* Vector # 211 ENET0 Interrupt Group1 ENET_1 */
    .long   ENET0_Tx_IRQHandler              /* Vector # 212 ENET0 Interrupt Group2 ENET_2 */
    .long   ENET0_Parser_IRQHandler          /* Vector # 213 ENET0 Interrupt Group3 ENET_3 */
    .long   ENET0_Timer_IRQHandler           /* Vector # 214 ENET0 Interrupt Group4 ENET_4 */
    .long   ENET0_Rx_1_IRQHandler            /* Vector # 215 ENET0 Interrupt Group5 ENET_5 */
    .long   ENET0_Tx_1_IRQHandler            /* Vector # 216 ENET0 Interrupt Group6 ENET_6 */
    .long   ENET0_Rx_2_IRQHandler            /* Vector # 217 ENET0 Interrupt Group7 ENET_7 */
    .long   ENET0_Tx_2_IRQHandler            /* Vector # 218 ENET0 Interrupt Group8 ENET_8 */
    .long   DefaultISR                       /* Vector # 219 */
    .long   DefaultISR                       /* Vector # 220 */
    .long   DefaultISR                       /* Vector # 221 */
    .long   DefaultISR                       /* Vector # 222 */
    .long   DefaultISR                       /* Vector # 223 */
    .long   RTC0_IRQHandler                  /* Vector # 224 Real Time Counter (RTC) RTC */
    .long   API0_IRQHandler                  /* Vector # 225 Autonomous Periodic Interrupt (API) API */
    .long   PIT_Ch0_IRQHandler               /* Vector # 226 Periodic Interrupt Timer (PIT0) PIT_1_TFLG0[TIF] */
    .long   PIT_Ch1_IRQHandler               /* Vector # 227 Periodic Interrupt Timer (PIT1) PIT_1_TFLG1[TIF] */
    .long   PIT_Ch2_IRQHandler               /* Vector # 228 Periodic Interrupt Timer (PIT2) PIT_1_TFLG2[TIF] */
    .long   PIT_Ch3_IRQHandler               /* Vector # 229 Periodic Interrupt Timer (PIT3) PIT_1_TFLG3[TIF] */
    .long   PIT_Ch4_IRQHandler               /* Vector # 230 Periodic Interrupt Timer (PIT4) PIT_1_TFLG4[TIF] */
    .long   PIT_Ch5_IRQHandler               /* Vector # 231 Periodic Interrupt Timer (PIT5) PIT_1_TFLG5[TIF] */
    .long   PIT_Ch6_IRQHandler               /* Vector # 232 Periodic Interrupt Timer (PIT6) PIT_1_TFLG6[TIF] */
    .long   PIT_Ch7_IRQHandler               /* Vector # 233 Periodic Interrupt Timer (PIT7) PIT_1_TFLG7[TIF] */
    .long   PIT_Ch8_IRQHandler               /* Vector # 234 Periodic Interrupt Timer (PIT8) PIT_1_TFLG8[TIF] */
    .long   PIT_Ch9_IRQHandler               /* Vector # 235 Periodic Interrupt Timer (PIT9) PIT_1_TFLG9[TIF] */
    .long   PIT_Ch10_IRQHandler              /* Vector # 236 Periodic Interrupt Timer (PIT10) PIT_1_TFLG10[TIF] */
    .long   PIT_Ch11_IRQHandler              /* Vector # 237 Periodic Interrupt Timer (PIT11) PIT_1_TFLG11[TIF] */
    .long   PIT_Ch12_IRQHandler              /* Vector # 238 Periodic Interrupt Timer (PIT12) PIT_1_TFLG12[TIF] */
    .long   PIT_Ch13_IRQHandler              /* Vector # 239 Periodic Interrupt Timer (PIT13) PIT_1_TFLG13[TIF] */
    .long   PIT_Ch14_IRQHandler              /* Vector # 240 Periodic Interrupt Timer (PIT14) PIT_1_TFLG14[TIF] */
    .long   PIT_Ch15_IRQHandler              /* Vector # 241 Periodic Interrupt Timer (PIT15) PIT_1_TFLG15[TIF] */
    .long   PIT_RTI_IRQHandler               /* Vector # 242 PIT_RTI PIT_RTI */
    .long   SIUL_EIRQ_00_07_IRQHandler       /* Vector # 243 SIUL EIRQ [0-7] - SIUL Combined External Interrupt */
    .long   SIUL_EIRQ_08_15_IRQHandler       /* Vector # 244 SIUL EIRQ [8-15] - SIUL Combined External Interrupt */
    .long   SIUL_EIRQ_16_23_IRQHandler       /* Vector # 245 SIUL EIRQ [16-23] - SIUL Combined External Interrupt */
    .long   SIUL_EIRQ_24_31_IRQHandler       /* Vector # 246 SIUL EIRQ [24-31] - SIUL Combined External Interrupt */
    .long   DefaultISR                       /* Vector # 247 */
    .long   DefaultISR                       /* Vector # 248 */
    .long   DefaultISR                       /* Vector # 249 */
    .long   DefaultISR                       /* Vector # 250 LPU_CTL o_interrupt */
    .long   DefaultISR                       /* Vector # 251 MC _ME ME_IS[I_SAFE] */
    .long   DefaultISR                       /* Vector # 252 MC _ME ME_IS[I_MTC] */
    .long   DefaultISR                       /* Vector # 253 MC _ME ME_IS[I_IMODE] */
    .long   DefaultISR                       /* Vector # 254 MC _ME ME_IS[I_ICONF] */
    .long   DefaultISR                       /* Vector # 255 MC_RGM MC_RGM Functional and destructive reset alternate event interrupt */
    .long   DefaultISR                       /* Vector # 256 */
    .long   DefaultISR                       /* Vector # 257 FXOSC Counter FXOSC Counter */
    .long   DefaultISR                       /* Vector # 258 SXOSC Counter SXOSC Counter */
    .long   DSPI0_FIFO_Error_IRQHandler      /* Vector # 259 DSPI0_0 DSPI_0_SR[TFUF] | DSPI_0_SR[RFOF] | DSPI_0_SR[TFIWF] */
    .long   DefaultISR                       /* Vector # 260 DSPI0_1 DSPI_0_SR[EOQF] */
    .long   DSPI0_Send_IRQHandler            /* Vector # 261 DSPI0_2 DSPI_0_SR[TFFF] */
    .long   DefaultISR                       /* Vector # 262 DSPI0_3 DSPI_0_SR[TCF] */
