FARLY7/xcan-router/ECU_Cluster_01/ECU_Cluster_01_Z4_0/Project_Settings/Startup_Code/startup_MPC5748G.S
    .long   DSPI0_Receive_IRQHandler         /* Vector # 263 DSPI0_4 DSPI_0_SR[RFDF] */
    .long   DefaultISR                       /* Vector # 264 DSPI0_5 DSPI_0_SR[SPITCF] | DSPI_0_SR[CMD_TCF] */
    .long   DefaultISR                       /* Vector # 265 DSPI0_6 DSPI_0_SR[DSITCF] | DSPI_0_SR[CMDFFF] */
    .long   DefaultISR                       /* Vector # 266 DSPI0_7 DSPI_0_SR[SPEF] | DSPI_0_SR[DPEF] */
    .long   DefaultISR                       /* Vector # 267 DSPI0_8 DSPI_0_SR[DDIF] */
    .long   DSPI1_FIFO_Error_IRQHandler      /* Vector # 268 DSPI1_0 DSPI_1_SR[TFUF] | DSPI_1_SR[RFOF]| DSPI_1_SR[TFIWF] */
    .long   DefaultISR                       /* Vector # 269 DSPI1_1 DSPI_1_SR[EOQF] */
    .long   DSPI1_Send_IRQHandler            /* Vector # 270 DSPI1_2 DSPI_1_SR[TFFF] */
    .long   DefaultISR                       /* Vector # 271 DSPI1_3 DSPI_1_SR[TCF] */
    .long   DSPI1_Receive_IRQHandler         /* Vector # 272 DSPI1_4 DSPI_1_SR[RFDF] */
    .long   DefaultISR                       /* Vector # 273 DSPI1_5 DSPI_1_SR[SPITCF] | DSPI_1_SR[CMD_TCF] */
    .long   DefaultISR                       /* Vector # 274 DSPI1_6 DSPI_1_SR[DSITCF] | DSPI_1_SR[CMDFFF] */
    .long   DefaultISR                       /* Vector # 275 DSPI1_7 DSPI_1_SR[SPEF] | DSPI_1_SR[DPEF] */
    .long   DefaultISR                       /* Vector # 276 DSPI1_8 DSPI_1_SR[DDIF] */
    .long   DSPI2_FIFO_Error_IRQHandler      /* Vector # 277 DSPI2_0 DSPI_2_SR[TFUF] | DSPI_2_SR[RFOF]| DSPI_2_SR[TFIWF] */
    .long   DefaultISR                       /* Vector # 278 DSPI2_1 DSPI_2_SR[EOQF] */
    .long   DSPI2_Send_IRQHandler            /* Vector # 279 DSPI2_2 DSPI_2_SR[TFFF] */
    .long   DefaultISR                       /* Vector # 280 DSPI2_3 DSPI_2_SR[TCF] */
    .long   DSPI2_Receive_IRQHandler         /* Vector # 281 DSPI2_4 DSPI_2_SR[RFDF] */
    .long   DefaultISR                       /* Vector # 282 DSPI2_5 DSPI_2_SR[SPITCF] | DSPI_2_SR[CMD_TCF] */
    .long   DefaultISR                       /* Vector # 283 DSPI2_6 DSPI_2_SR[DSITCF] | DSPI_2_SR[CMDFFF] */
    .long   DefaultISR                       /* Vector # 284 DSPI2_7 DSPI_2_SR[SPEF] | DSPI_2_SR[DPEF] */
    .long   DefaultISR                       /* Vector # 285 DSPI2_8 DSPI_2_SR[DDIF] */
    .long   DSPI3_FIFO_Error_IRQHandler      /* Vector # 286 DSPI3_0 DSPI_3_SR[TFUF] | DSPI_3_SR[RFOF]| DSPI_3_SR[TFIWF] */
    .long   DefaultISR                       /* Vector # 287 DSPI3_1 DSPI_3_SR[EOQF] */
    .long   DSPI3_Send_IRQHandler            /* Vector # 288 DSPI3_2 DSPI_3_SR[TFFF] */
    .long   DefaultISR                       /* Vector # 289 DSPI3_3 DSPI_3_SR[TCF] */
    .long   DSPI3_Receive_IRQHandler         /* Vector # 290 DSPI3_4 DSPI_3_SR[RFDF] */
    .long   DefaultISR                       /* Vector # 291 DSPI3_5 DSPI_3_SR[SPITCF] | DSPI_3_SR[CMD_TCF] */
    .long   DefaultISR                       /* Vector # 292 DSPI3_6 DSPI_3_SR[DSITCF] | DSPI_3_SR[CMDFFF] */
    .long   DefaultISR                       /* Vector # 293 DSPI3_7 DSPI_3_SR[SPEF] | DSPI_3_SR[DPEF] */
    .long   DefaultISR                       /* Vector # 294 DSPI3_8 DSPI_3_SR[DDIF] */
    .long   DSPI4_FIFO_Error_IRQHandler      /* Vector # 295 DSPI4_0 DSPI_4_SR[TFUF] | DSPI_4_SR[RFOF]| DSPI_4_SR[TFIWF] */
    .long   DefaultISR                       /* Vector # 296 DSPI4_1 DSPI_4_SR[EOQF] */
    .long   DSPI4_Send_IRQHandler            /* Vector # 297 DSPI4_2 DSPI_4_SR[TFFF] */
    .long   DefaultISR                       /* Vector # 298 DSPI4_3 DSPI_4_SR[TCF] */
    .long   DSPI4_Receive_IRQHandler         /* Vector # 299 DSPI4_4 DSPI_4_SR[RFDF] */
    .long   DefaultISR                       /* Vector # 300 DSPI4_5 DSPI_4_SR[SPITCF] | DSPI_4_SR[CMD_TCF] */
    .long   DefaultISR                       /* Vector # 301 DSPI4_6 DSPI_4_SR[DSITCF] | DSPI_4_SR[CMDFFF] */
    .long   DefaultISR                       /* Vector # 302 DSPI4_7 DSPI_4_SR[SPEF] | DSPI_4_SR[DPEF] */
    .long   DefaultISR                       /* Vector # 303 */
    .long   DSPI5_FIFO_Error_IRQHandler      /* Vector # 304 DSPI5_0 DSPI_5_SR[TFUF] | DSPI_5_SR[RFOF]| DSPI_5_SR[TFIWF] */
    .long   DefaultISR                       /* Vector # 305 DSPI5_1 DSPI_5_SR[EOQF] */
    .long   DSPI5_Send_IRQHandler            /* Vector # 306 DSPI5_2 DSPI_5_SR[TFFF] */
    .long   DefaultISR                       /* Vector # 307 DSPI5_3 DSPI_5_SR[TCF] */
    .long   DSPI5_Receive_IRQHandler         /* Vector # 308 DSPI5_4 DSPI_5_SR[RFDF] */
    .long   DefaultISR                       /* Vector # 309 DSPI5_5 DSPI_5_SR[SPITCF] | DSPI_5_SR[CMD_TCF] */
    .long   DefaultISR                       /* Vector # 310 DSPI5_6 DSPI_5_SR[DSITCF] | DSPI_5_SR[CMDFFF] */
    .long   DefaultISR                       /* Vector # 311 DSPI5_7 DSPI_5_SR[SPEF] | DSPI_5_SR[DPEF] */
    .long   DefaultISR                       /* Vector # 312 */
    .long   DSPI6_FIFO_Error_IRQHandler      /* Vector # 313 DSPI6_0 DSPI_6_SR[TFUF] | DSPI_6_SR[RFOF]| DSPI_6_SR[TFIWF] */
    .long   DefaultISR                       /* Vector # 314 DSPI6_1 DSPI_6_SR[EOQF] */
    .long   DSPI6_Send_IRQHandler            /* Vector # 315 DSPI6_2 DSPI_6_SR[TFFF] */
    .long   DefaultISR                       /* Vector # 316 DSPI6_3 DSPI_6_SR[TCF] */
    .long   DSPI6_Receive_IRQHandler         /* Vector # 317 DSPI6_4 DSPI_6_SR[RFDF] */
    .long   DefaultISR                       /* Vector # 318 DSPI6_5 DSPI_6_SR[SPITCF] | DSPI_6_SR[CMD_TCF] */
    .long   DefaultISR                       /* Vector # 319 DSPI6_6 DSPI_6_SR[DSITCF] | DSPI_6_SR[CMDFFF] */
    .long   DefaultISR                       /* Vector # 320 DSPI6_7 DSPI_6_SR[SPEF] | DSPI_6_SR[DPEF] */
    .long   DefaultISR                       /* Vector # 321 */
    .long   DSPI7_FIFO_Error_IRQHandler      /* Vector # 322 DSPI7_0 DSPI_7_SR[TFUF] | DSPI_7_SR[RFOF]| DSPI_7_SR[TFIWF] */
    .long   DefaultISR                       /* Vector # 323 DSPI7_1 DSPI_7_SR[EOQF] */
    .long   DSPI7_Send_IRQHandler            /* Vector # 324 DSPI7_2 DSPI_7_SR[TFFF] */
    .long   DefaultISR                       /* Vector # 325 DSPI7_3 DSPI_7_SR[TCF] */
    .long   DSPI7_Receive_IRQHandler         /* Vector # 326 DSPI7_4 DSPI_7_SR[RFDF] */
    .long   DefaultISR                       /* Vector # 327 DSPI7_5 DSPI_7_SR[SPITCF] */
    .long   DefaultISR                       /* Vector # 328 DSPI7_6 DSPI_7_SR[DSITCF] */
    .long   DefaultISR                       /* Vector # 329 DSPI7_7 DSPI_7_SR[SPEF] | DSPI_7_SR[DPEF] */
    .long   DefaultISR                       /* Vector # 330 */
    .long   DSPI8_FIFO_Error_IRQHandler      /* Vector # 331 DSPI8_0 DSPI_8_SR[TFUF] | DSPI_8_SR[RFOF]| DSPI_8_SR[TFIWF] */
    .long   DefaultISR                       /* Vector # 332 DSPI8_1 DSPI_8_SR[EOQF] */
    .long   DSPI8_Send_IRQHandler            /* Vector # 333 DSPI8_2 DSPI_8_SR[TFFF] */
    .long   DefaultISR                       /* Vector # 334 DSPI8_3 DSPI_8_SR[TCF] */
    .long   DSPI8_Receive_IRQHandler         /* Vector # 335 DSPI8_4 DSPI_8_SR[RFDF] */
    .long   DefaultISR                       /* Vector # 336 DSPI8_5 DSPI_8_SR[SPITCF] */
    .long   DefaultISR                       /* Vector # 337 DSPI8_6 DSPI_8_SR[DSITCF] */
    .long   DefaultISR                       /* Vector # 338 DSPI8_7 DSPI_8_SR[SPEF] | DSPI_8_SR[DPEF] */
    .long   DefaultISR                       /* Vector # 339 */
    .long   DSPI9_FIFO_Error_IRQHandler      /* Vector # 340 DSPI9_0 DSPI_9_SR[TFUF] | DSPI_9_SR[RFOF]| DSPI_9_SR[TFIWF] */
    .long   DefaultISR                       /* Vector # 341 DSPI9_1 DSPI_9_SR[EOQF] */
    .long   DSPI9_Send_IRQHandler            /* Vector # 342 DSPI9_2 DSPI_9_SR[TFFF] */
    .long   DefaultISR                       /* Vector # 343 DSPI9_3 DSPI_9_SR[TCF] */
    .long   DSPI9_Receive_IRQHandler         /* Vector # 344 DSPI9_4 DSPI_9_SR[RFDF] */
    .long   DefaultISR                       /* Vector # 345 DSPI9_5 DSPI_9_SR[SPITCF] */
    .long   DefaultISR                       /* Vector # 346 DSPI9_6 DSPI_9_SR[DSITCF] */
    .long   DefaultISR                       /* Vector # 347 DSPI9_7 DSPI_9_SR[SPEF] | DSPI_9_SR[DPEF] */
    .long   DefaultISR                       /* Vector # 348 */
    .long   DefaultISR                       /* Vector # 349 */
    .long   DefaultISR                       /* Vector # 350 */
    .long   DefaultISR                       /* Vector # 351 */
    .long   DefaultISR                       /* Vector # 352 */
    .long   DefaultISR                       /* Vector # 353 */
    .long   DefaultISR                       /* Vector # 354 */
    .long   DefaultISR                       /* Vector # 355 */
    .long   DefaultISR                       /* Vector # 356 */
    .long   DefaultISR                       /* Vector # 357 */
    .long   DefaultISR                       /* Vector # 358 */
    .long   DefaultISR                       /* Vector # 359 */
    .long   DefaultISR                       /* Vector # 360 */
    .long   DefaultISR                       /* Vector # 361 */
    .long   DefaultISR                       /* Vector # 362 */
    .long   DefaultISR                       /* Vector # 363 */
    .long   DefaultISR                       /* Vector # 364 */
    .long   DefaultISR                       /* Vector # 365 */
    .long   DefaultISR                       /* Vector # 366 */
    .long   DefaultISR                       /* Vector # 367 */
    .long   DefaultISR                       /* Vector # 368 */
    .long   DefaultISR                       /* Vector # 369 */
    .long   DefaultISR                       /* Vector # 370 */
    .long   DefaultISR                       /* Vector # 371 */
    .long   BCTU_ListLast_IRQHandler         /* Vector # 372 BCTU LIST0_LAST | LIST1_LAST */
    .long   BCTU_ConvUpdate_IRQHandler       /* Vector # 373 BCTU NDATA0 | NDATA1 | DATA_OVR0 | DATA_OVR1 | TRGF */
    .long   DefaultISR                       /* Vector # 374 */
    .long   DefaultISR                       /* Vector # 375 */
    .long   LINFLEXD0_UART_RxIRQHandler      /* Vector # 376 LinFlex_0_RXI */
    .long   LINFLEXD0_UART_TxIRQHandler      /* Vector # 377 LinFlex_0_TXI */
    .long   LINFLEXD0_UART_ErrIRQHandler     /* Vector # 378 LinFlex_0_ERR */
    .long   LINFLEXD1_UART_RxIRQHandler      /* Vector # 379 LinFlex_1_RXI */
    .long   LINFLEXD1_UART_TxIRQHandler      /* Vector # 380 LinFlex_1_TXI */
    .long   LINFLEXD1_UART_ErrIRQHandler     /* Vector # 381 LinFlex_1_ERR */
    .long   LINFLEXD2_UART_RxIRQHandler      /* Vector # 382 LinFlex_2_RXI */
    .long   LINFLEXD2_UART_TxIRQHandler      /* Vector # 383 LinFlex_2_TXI */
    .long   LINFLEXD2_UART_ErrIRQHandler     /* Vector # 384 LinFlex_2_ERR */
    .long   LINFLEXD3_UART_RxIRQHandler      /* Vector # 385 LinFlex_3_RXI */
    .long   LINFLEXD3_UART_TxIRQHandler      /* Vector # 386 LinFlex_3_TXI */
    .long   LINFLEXD3_UART_ErrIRQHandler     /* Vector # 387 LinFlex_3_ERR */
    .long   LINFLEXD4_UART_RxIRQHandler      /* Vector # 388 LinFlex_4_RXI */
    .long   LINFLEXD4_UART_TxIRQHandler      /* Vector # 389 LinFlex_4_TXI */
    .long   LINFLEXD4_UART_ErrIRQHandler     /* Vector # 390 LinFlex_4_ERR */
    .long   LINFLEXD5_UART_RxIRQHandler      /* Vector # 391 LinFlex_5_RXI */
    .long   LINFLEXD5_UART_TxIRQHandler      /* Vector # 392 LinFlex_5_TXI */
    .long   LINFLEXD5_UART_ErrIRQHandler     /* Vector # 393 LinFlex_5_ERR */
    .long   LINFLEXD6_UART_RxIRQHandler      /* Vector # 394 LinFlex_6_RXI */
    .long   LINFLEXD6_UART_TxIRQHandler      /* Vector # 395 LinFlex_6_TXI */
    .long   LINFLEXD6_UART_ErrIRQHandler     /* Vector # 396 LinFlex_6_ERR */
    .long   LINFLEXD7_UART_RxIRQHandler      /* Vector # 397 LinFlex_7_RXI */
    .long   LINFLEXD7_UART_TxIRQHandler      /* Vector # 398 LinFlex_7_TXI */
    .long   LINFLEXD7_UART_ErrIRQHandler     /* Vector # 399 LinFlex_7_ERR */
    .long   LINFLEXD8_UART_RxIRQHandler      /* Vector # 400 LinFlex_8_RXI */
    .long   LINFLEXD8_UART_TxIRQHandler      /* Vector # 401 LinFlex_8_TXI */
    .long   LINFLEXD8_UART_ErrIRQHandler     /* Vector # 402 LinFlex_8_ERR */
    .long   LINFLEXD9_UART_RxIRQHandler      /* Vector # 403 LinFlex_9_RXI */
    .long   LINFLEXD9_UART_TxIRQHandler      /* Vector # 404 LinFlex_9_TXI */
    .long   LINFLEXD9_UART_ErrIRQHandler     /* Vector # 405 LinFlex_9_ERR */
    .long   LINFLEXD10_UART_RxIRQHandler     /* Vector # 406 LinFlex_10_RXI */
    .long   LINFLEXD10_UART_TxIRQHandler     /* Vector # 407 LinFlex_10_TXI */
    .long   LINFLEXD10_UART_ErrIRQHandler    /* Vector # 408 LinFlex_10_ERR */
    .long   LINFLEXD11_UART_RxIRQHandler     /* Vector # 409 LinFlex_11_RXI */
    .long   LINFLEXD11_UART_TxIRQHandler     /* Vector # 410 LinFlex_11_TXI */
    .long   LINFLEXD11_UART_ErrIRQHandler    /* Vector # 411 LinFlex_11_ERR */
    .long   LINFLEXD12_UART_RxIRQHandler     /* Vector # 412 LinFlex_12_RXI */
    .long   LINFLEXD12_UART_TxIRQHandler     /* Vector # 413 LinFlex_12_TXI */
    .long   LINFLEXD12_UART_ErrIRQHandler    /* Vector # 414 LinFlex_12_ERR */
    .long   LINFLEXD13_UART_RxIRQHandler     /* Vector # 415 LinFlex_13_RXI */
    .long   LINFLEXD13_UART_TxIRQHandler     /* Vector # 416 LinFlex_13_TXI */
    .long   LINFLEXD13_UART_ErrIRQHandler    /* Vector # 417 LinFlex_13_ERR */
    .long   LINFLEXD14_UART_RxIRQHandler     /* Vector # 418 LinFlex_14_RXI */
    .long   LINFLEXD14_UART_TxIRQHandler     /* Vector # 419 LinFlex_14_TXI */
    .long   LINFLEXD14_UART_ErrIRQHandler    /* Vector # 420 LinFlex_14_ERR */
    .long   LINFLEXD15_UART_RxIRQHandler     /* Vector # 421 LinFlex_15_RXI */
    .long   LINFLEXD15_UART_TxIRQHandler     /* Vector # 422 LinFlex_15_TXI */
    .long   LINFLEXD15_UART_ErrIRQHandler    /* Vector # 423 LinFlex_15_ERR */
    .long   LINFLEXD16_UART_RxIRQHandler     /* Vector # 424 LinFlex_16_RXI */
    .long   LINFLEXD16_UART_TxIRQHandler     /* Vector # 425 LinFlex_16_TXI */
    .long   LINFLEXD16_UART_ErrIRQHandler    /* Vector # 426 LinFlex_16_ERR */
    .long   LINFLEXD17_UART_RxIRQHandler     /* Vector # 427 LinFlex_17_RXI */
    .long   LINFLEXD17_UART_TxIRQHandler     /* Vector # 428 LinFlex_17_TXI */
    .long   LINFLEXD17_UART_ErrIRQHandler    /* Vector # 429 LinFlex_17_ERR */
    .long   DefaultISR                       /* Vector # 430 */
    .long   DefaultISR                       /* Vector # 431 */
    .long   DefaultISR                       /* Vector # 432 */
    .long   DefaultISR                       /* Vector # 433 */
    .long   DefaultISR                       /* Vector # 434 */
    .long   DefaultISR                       /* Vector # 435 */
    .long   DefaultISR                       /* Vector # 436 */
    .long   DefaultISR                       /* Vector # 437 */
    .long   DefaultISR                       /* Vector # 438 */
    .long   DefaultISR                       /* Vector # 439 */
    .long   I2C_DRV_Module0IRQHandler        /* Vector # 440 I2C_0_0 I2C0_SR[IBAL] | I2C0_SR[TCF] | I2C0_SR[IAAS] */
    .long   DefaultISR                       /* Vector # 441 */
    .long   I2C_DRV_Module1IRQHandler        /* Vector # 442 I2C_1_0 I2C1_SR[IBAL] | I2C1_SR[TCF] | I2C1_SR[IAAS] */
    .long   DefaultISR                       /* Vector # 443 */
    .long   I2C_DRV_Module2IRQHandler        /* Vector # 444 I2C_2_0 I2C2_SR[IBAL] | I2C2_SR[TCF] | I2C2_SR[IAAS] */
    .long   DefaultISR                       /* Vector # 445 */
    .long   I2C_DRV_Module3IRQHandler        /* Vector # 446 I2C_3_0 I2C3_SR[IBAL] | I2C3_SR[TCF] | I2C3_SR[IAAS] */
    .long   DefaultISR                       /* Vector # 447 */
    .long   DefaultISR                       /* Vector # 448 */
    .long   DefaultISR                       /* Vector # 449 */
    .long   DefaultISR                       /* Vector # 450 */
    .long   DefaultISR                       /* Vector # 451 */
    .long   DefaultISR                       /* Vector # 452 */
    .long   DefaultISR                       /* Vector # 453 FlexRay_0_0 LRNEIF | DRNEIF */
    .long   DefaultISR                       /* Vector # 454 FlexRay_0_1 LRCEIF | DRCEIF */
    .long   DefaultISR                       /* Vector # 455 FlexRay_0_2 FNEAIF */
    .long   DefaultISR                       /* Vector # 456 FlexRay_0_3 FNEBIF */
    .long   DefaultISR                       /* Vector # 457 FlexRay_0_4 WUPIF */
    .long   DefaultISR                       /* Vector # 458 FlexRay_0_5 PRIF */
    .long   DefaultISR                       /* Vector # 459 FlexRay_0_6 CHIF */
    .long   DefaultISR                       /* Vector # 460 FlexRay_0_7 TBIF */
    .long   DefaultISR                       /* Vector # 461 FlexRay_0_8 RBIF */
    .long   DefaultISR                       /* Vector # 462 FlexRay_0_9 MIF */
    .long   DefaultISR                       /* Vector # 463 */
    .long   DefaultISR                       /* Vector # 464 */
    .long   DefaultISR                       /* Vector # 465 */
    .long   DefaultISR                       /* Vector # 466 */
    .long   DefaultISR                       /* Vector # 467 */
    .long   DefaultISR                       /* Vector # 468 */
    .long   DefaultISR                       /* Vector # 469 */
    .long   DefaultISR                       /* Vector # 470 */
    .long   DefaultISR                       /* Vector # 471 */
    .long   DefaultISR                       /* Vector # 472 */
    .long   DefaultISR                       /* Vector # 473 */
    .long   DefaultISR                       /* Vector # 474 */
    .long   DefaultISR                       /* Vector # 475 */
    .long   DefaultISR                       /* Vector # 476 */
    .long   DefaultISR                       /* Vector # 477 Power Monitor Unit LVD/HVD self checking fault */
    .long   DefaultISR                       /* Vector # 478 */
    .long   DefaultISR                       /* Vector # 479 */
    .long   DefaultISR                       /* Vector # 480 PLL Loss-of-lock interrupt request for PLL */
    .long   DefaultISR                       /* Vector # 481 */
    .long   DefaultISR                       /* Vector # 482 */
    .long   DefaultISR                       /* Vector # 483 */
    .long   DefaultISR                       /* Vector # 484 PLL Indicates PLL Power down process completed by MC_ME */
    .long   DefaultISR                       /* Vector # 485 */
    .long   DefaultISR                       /* Vector # 486 */
    .long   DefaultISR                       /* Vector # 487 */
    .long   FCCU0_IRQ_Handler                /* Vector # 488 FCCU Interrupt request (ALARM state) */
    .long   FCCU0_IRQ_Handler                /* Vector # 489 FCCU Interrupt request (miscellaneous conditions) */
    .long   FCCU0_IRQ_Handler                /* Vector # 490 FCCU EOUT interrupt */
    .long   DefaultISR                       /* Vector # 491 */
    .long   DefaultISR                       /* Vector # 492 */
    .long   DefaultISR                       /* Vector # 493 */
    .long   DefaultISR                       /* Vector # 494 STCU Interrupt request line related to online MBIST execution */
    .long   DefaultISR                       /* Vector # 495 STCU Interrupt request line related to online LBIST execution */
    .long   DefaultISR                       /* Vector # 496 Hardware Security Module 0 HSM2HTIE[0] */
    .long   HSM_DRV_IRQHandler               /* Vector # 497 Hardware Security Module 1 HSM2HTIE[1] */
    .long   DefaultISR                       /* Vector # 498 Hardware Security Module 2 HSM2HTIE[2] */
    .long   DefaultISR                       /* Vector # 499 Hardware Security Module 3 HSM2HTIE[3] */
    .long   DefaultISR                       /* Vector # 500 Hardware Security Module 4 HSM2HTIE[4] */
    .long   DefaultISR                       /* Vector # 501 Hardware Security Module 5 HSM2HTIE[5] */
    .long   DefaultISR                       /* Vector # 502 Hardware Security Module 6 HSM2HTIE[6] */
    .long   DefaultISR                       /* Vector # 503 Hardware Security Module 7 HSM2HTIE[7] */
    .long   DefaultISR                       /* Vector # 504 Hardware Security Module 8 HSM2HTIE[8] */
    .long   DefaultISR                       /* Vector # 505 Hardware Security Module 9 HSM2HTIE[9] */
    .long   DefaultISR                       /* Vector # 506 Hardware Security Module 10 HSM2HTIE[10] */
    .long   DefaultISR                       /* Vector # 507 Hardware Security Module 11 HSM2HTIE[11] */
    .long   DefaultISR                       /* Vector # 508 Hardware Security Module 12 HSM2HTIE[12] */
    .long   DefaultISR                       /* Vector # 509 Hardware Security Module 13 HSM2HTIE[13] */
    .long   DefaultISR                       /* Vector # 510 Hardware Security Module 14 HSM2HTIE[14] */
    .long   DefaultISR                       /* Vector # 511 Hardware Security Module 15 HSM2HTIE[15] */
    .long   DefaultISR                       /* Vector # 512 Hardware Security Module 16 HSM2HTIE[16] */
    .long   DefaultISR                       /* Vector # 513 Hardware Security Module 17 HSM2HTIE[17] */
    .long   DefaultISR                       /* Vector # 514 Hardware Security Module 18 HSM2HTIE[18] */
    .long   DefaultISR                       /* Vector # 515 Hardware Security Module 19 HSM2HTIE[19] */
    .long   DefaultISR                       /* Vector # 516 Hardware Security Module 20 HSM2HTIE[20] */
    .long   DefaultISR                       /* Vector # 517 Hardware Security Module 21 HSM2HTIE[21] */
    .long   DefaultISR                       /* Vector # 518 Hardware Security Module 22 HSM2HTIE[22] */
    .long   DefaultISR                       /* Vector # 519 Hardware Security Module 23 HSM2HTIE[23] */
    .long   DefaultISR                       /* Vector # 520 Hardware Security Module 24 HSM2HTIE[24] */
    .long   DefaultISR                       /* Vector # 521 Hardware Security Module 25 HSM2HTIE[25] */
    .long   DefaultISR                       /* Vector # 522 Hardware Security Module 26 HSM2HTIE[26] */
    .long   DefaultISR                       /* Vector # 523 Hardware Security Module 27 HSM2HTIE[27] */
    .long   DefaultISR                       /* Vector # 524 Hardware Security Module 28 HSM2HTIE[28] */
    .long   DefaultISR                       /* Vector # 525 Hardware Security Module 29 HSM2HTIE[29] */
    .long   DefaultISR                       /* Vector # 526 Hardware Security Module 30 HSM2HTIE[30] */
    .long   DefaultISR                       /* Vector # 527 Hardware Security Module 31 HSM2HTIE[31] */
    .long   DefaultISR                       /* Vector # 528 */
    .long   DefaultISR                       /* Vector # 529 */
    .long   DefaultISR                       /* Vector # 530 */
    .long   DefaultISR                       /* Vector # 531 */
    .long   DefaultISR                       /* Vector # 532 */
    .long   DefaultISR                       /* Vector # 533 */
    .long   DefaultISR                       /* Vector # 534 */
    .long   DefaultISR                       /* Vector # 535 */
    .long   DefaultISR                       /* Vector # 536 */
    .long   DefaultISR                       /* Vector # 537 */
    .long   DefaultISR                       /* Vector # 538 */
    .long   DefaultISR                       /* Vector # 539 */
    .long   DefaultISR                       /* Vector # 540 */
    .long   DefaultISR                       /* Vector # 541 */
    .long   DefaultISR                       /* Vector # 542 */
    .long   DefaultISR                       /* Vector # 543 */
