FARLY7/xcan-router/ECU_Cluster_01/ECU_Cluster_01_Z4_0/Project_Settings/Startup_Code/startup_MPC5748G.S
    .long   DefaultISR                       /* Vector # 544 */
    .long   DefaultISR                       /* Vector # 545 */
    .long   DefaultISR                       /* Vector # 546 */
    .long   DefaultISR                       /* Vector # 547 */
    .long   ADC0_EOC_IRQHandler              /* Vector # 548 ADC_0_EOC ADC_0_EOC */
    .long   ADC0_ER_IRQHandler               /* Vector # 549 ADC_0_ER ADC_0_ER */
    .long   ADC0_WD_IRQHandler               /* Vector # 550 ADC_0_WD ADC_0_WD */
    .long   DefaultISR                       /* Vector # 551 */
    .long   DefaultISR                       /* Vector # 552 */
    .long   DefaultISR                       /* Vector # 553 */
    .long   ADC1_EOC_IRQHandler              /* Vector # 554 ADC_1_EOC ADC_1_EOC */
    .long   ADC1_ER_IRQHandler               /* Vector # 555 ADC_1_ER ADC_1_ER */
    .long   ADC1_WD_IRQHandler               /* Vector # 556 ADC_1_WD ADC_1_WD */
    .long   DefaultISR                       /* Vector # 557 */
    .long   DefaultISR                       /* Vector # 558 */
    .long   DefaultISR                       /* Vector # 559 */
    .long   CMP0_IRQHandler                  /* Vector # 560 Analogue_Comparator_Module_0 CMP0 */
    .long   CMP1_IRQHandler                  /* Vector # 561 Analogue_Comparator_Module_1 CMP1 */
    .long   CMP2_IRQHandler                  /* Vector # 562 Analogue_Comparator_Module_2 CMP2 */
    .long   DefaultISR                       /* Vector # 563 */
    .long   DefaultISR                       /* Vector # 564 */
    .long   CAN0_Wake_Up_IRQHandler          /* Vector # 565 FlexCAN0_0 FlexCAN0_PN */
    .long   CAN0_Error_IRQHandler            /* Vector # 566 FlexCAN0_1 FLEXCAN_0_ESR[ERR_INT] */
    .long   CAN0_ORed_IRQHandler             /* Vector # 567 FlexCAN0_2 FLEXCAN_0_ESR_BOFF | FLEXCAN_0_Transmit_Warning | FLEXCAN_0_Receive_Warning */
    .long   CAN0_ORed_00_03_MB_IRQHandler    /* Vector # 568 FlexCAN0_3 FlexCAN0_BUF_00_03 */
    .long   CAN0_ORed_04_07_MB_IRQHandler    /* Vector # 569 FlexCAN0_4 FlexCAN0_BUF_04_07 */
    .long   CAN0_ORed_08_11_MB_IRQHandler    /* Vector # 570 FlexCAN0_5 FlexCAN0_BUF_08_11 */
    .long   CAN0_ORed_12_15_MB_IRQHandler    /* Vector # 571 FlexCAN0_6 FlexCAN0_BUF_12_15 */
    .long   CAN0_ORed_16_31_MB_IRQHandler    /* Vector # 572 FlexCAN0_7 FlexCAN0_BUF_16_31 */
    .long   CAN0_ORed_32_63_MB_IRQHandler    /* Vector # 573 FlexCAN0_8 FlexCAN0_BUF_32_63 */
    .long   CAN0_ORed_64_95_MB_IRQHandler    /* Vector # 574 FlexCAN0_9 FlexCAN0_BUF_64_95 */
    .long   DefaultISR                       /* Vector # 575 */
    .long   DefaultISR                       /* Vector # 576 */
    .long   DefaultISR                       /* Vector # 577 */
    .long   CAN1_Error_IRQHandler            /* Vector # 578 FlexCAN1_0 FLEXCAN_1_ESR[ERR_INT] */
    .long   CAN1_ORed_IRQHandler             /* Vector # 579 FlexCAN1_1 FLEXCAN_1_ESR_BOFF | FLEXCAN_1_Transmit_Warning | FLEXCAN_1_Receive_Warning */
    .long   CAN1_ORed_00_03_MB_IRQHandler    /* Vector # 580 FlexCAN1_2 FlexCAN1_BUF_00_03 */
    .long   CAN1_ORed_04_07_MB_IRQHandler    /* Vector # 581 FlexCAN1_3 FlexCAN1_BUF_04_07 */
    .long   CAN1_ORed_08_11_MB_IRQHandler    /* Vector # 582 FlexCAN1_4 FlexCAN1_BUF_08_11 */
    .long   CAN1_ORed_12_15_MB_IRQHandler    /* Vector # 583 FlexCAN1_5 FlexCAN1_BUF_12_15 */
    .long   CAN1_ORed_16_31_MB_IRQHandler    /* Vector # 584 FlexCAN1_6 FlexCAN1_BUF_16_31 */
    .long   CAN1_ORed_32_63_MB_IRQHandler    /* Vector # 585 FlexCAN1_7 FlexCAN1_BUF_32_63 */
    .long   CAN1_ORed_64_95_MB_IRQHandler    /* Vector # 586 FlexCAN1_8 FlexCAN0_BUF_64_95 */
    .long   DefaultISR                       /* Vector # 587 */
    .long   DefaultISR                       /* Vector # 588 */
    .long   DefaultISR                       /* Vector # 589 */
    .long   CAN2_Error_IRQHandler            /* Vector # 590 FlexCAN2_0 FLEXCAN_2_ESR[ERR_INT] */
    .long   CAN2_ORed_IRQHandler             /* Vector # 591 FlexCAN2_1 FLEXCAN_2_ESR_BOFF | FLEXCAN_2_Transmit_Warning | FLEXCAN_2_Receive_Warning */
    .long   CAN2_ORed_00_03_MB_IRQHandler    /* Vector # 592 FlexCAN2_2 FlexCAN2_BUF_00_03 */
    .long   CAN2_ORed_04_07_MB_IRQHandler    /* Vector # 593 FlexCAN2_3 FlexCAN2_BUF_04_07 */
    .long   CAN2_ORed_08_11_MB_IRQHandler    /* Vector # 594 FlexCAN2_4 FlexCAN2_BUF_08_11 */
    .long   CAN2_ORed_12_15_MB_IRQHandler    /* Vector # 595 FlexCAN2_5 FlexCAN2_BUF_12_15 */
    .long   CAN2_ORed_16_31_MB_IRQHandler    /* Vector # 596 FlexCAN2_6 FlexCAN2_BUF_16_31 */
    .long   CAN2_ORed_32_63_MB_IRQHandler    /* Vector # 597 FlexCAN2_7 FlexCAN2_BUF_32_63 */
    .long   CAN2_ORed_64_95_MB_IRQHandler    /* Vector # 598 FlexCAN2_8 FlexCAN0_BUF_64_95 */
    .long   DefaultISR                       /* Vector # 599 */
    .long   DefaultISR                       /* Vector # 600 */
    .long   DefaultISR                       /* Vector # 601 */
    .long   CAN3_Error_IRQHandler            /* Vector # 602 FlexCAN3_0 FLEXCAN_3_ESR[ERR_INT] */
    .long   CAN3_ORed_IRQHandler             /* Vector # 603 FlexCAN3_1 FLEXCAN_3_ESR_BOFF | FLEXCAN_3_Transmit_Warning | FLEXCAN_3_Receive_Warning */
    .long   CAN3_ORed_00_03_MB_IRQHandler    /* Vector # 604 FlexCAN3_2 FlexCAN3_BUF_00_03 */
    .long   CAN3_ORed_04_07_MB_IRQHandler    /* Vector # 605 FlexCAN3_3 FlexCAN3_BUF_04_07 */
    .long   CAN3_ORed_08_11_MB_IRQHandler    /* Vector # 606 FlexCAN3_4 FlexCAN3_BUF_08_11 */
    .long   CAN3_ORed_12_15_MB_IRQHandler    /* Vector # 607 FlexCAN3_5 FlexCAN3_BUF_12_15 */
    .long   CAN3_ORed_16_31_MB_IRQHandler    /* Vector # 608 FlexCAN3_6 FlexCAN3_BUF_16_31 */
    .long   CAN3_ORed_32_63_MB_IRQHandler    /* Vector # 609 FlexCAN3_7 FlexCAN3_BUF_32_63 */
    .long   CAN3_ORed_64_95_MB_IRQHandler    /* Vector # 610 FlexCAN3_8 FlexCAN0_BUF_64_95 */
    .long   DefaultISR                       /* Vector # 611 */
    .long   DefaultISR                       /* Vector # 612 */
    .long   DefaultISR                       /* Vector # 613 */
    .long   CAN4_Error_IRQHandler            /* Vector # 614 FlexCAN4_0 FLEXCAN_4_ESR[ERR_INT] */
    .long   CAN4_ORed_IRQHandler             /* Vector # 615 FlexCAN4_1 FLEXCAN_4_ESR_BOFF | FLEXCAN_4_Transmit_Warning | FLEXCAN_4_Receive_Warning */
    .long   CAN4_ORed_00_03_MB_IRQHandler    /* Vector # 616 FlexCAN4_2 FlexCAN4_BUF_00_03 */
    .long   CAN4_ORed_04_07_MB_IRQHandler    /* Vector # 617 FlexCAN4_3 FlexCAN4_BUF_04_07 */
    .long   CAN4_ORed_08_11_MB_IRQHandler    /* Vector # 618 FlexCAN4_4 FlexCAN4_BUF_08_11 */
    .long   CAN4_ORed_12_15_MB_IRQHandler    /* Vector # 619 FlexCAN4_5 FlexCAN4_BUF_12_15 */
    .long   CAN4_ORed_16_31_MB_IRQHandler    /* Vector # 620 FlexCAN4_6 FlexCAN4_BUF_16_31 */
    .long   CAN4_ORed_32_63_MB_IRQHandler    /* Vector # 621 FlexCAN4_7 FlexCAN4_BUF_32_63 */
    .long   CAN4_ORed_64_95_MB_IRQHandler    /* Vector # 622 FlexCAN4_8 FlexCAN0_BUF_64_95 */
    .long   DefaultISR                       /* Vector # 623 */
    .long   DefaultISR                       /* Vector # 624 */
    .long   DefaultISR                       /* Vector # 625 */
    .long   CAN5_Error_IRQHandler            /* Vector # 626 FlexCAN5_0 FLEXCAN_5_ESR[ERR_INT] */
    .long   CAN5_ORed_IRQHandler             /* Vector # 627 FlexCAN5_1 FLEXCAN_5_ESR_BOFF | FLEXCAN_5_Transmit_Warning | FLEXCAN_5_Receive_Warning */
    .long   CAN5_ORed_00_03_MB_IRQHandler    /* Vector # 628 FlexCAN5_2 FlexCAN5_BUF_00_03 */
    .long   CAN5_ORed_04_07_MB_IRQHandler    /* Vector # 629 FlexCAN5_3 FlexCAN5_BUF_04_07 */
    .long   CAN5_ORed_08_11_MB_IRQHandler    /* Vector # 630 FlexCAN5_4 FlexCAN5BUF_08_11 */
    .long   CAN5_ORed_12_15_MB_IRQHandler    /* Vector # 631 FlexCAN5_5 FlexCAN5_BUF_12_15 */
    .long   CAN5_ORed_16_31_MB_IRQHandler    /* Vector # 632 FlexCAN5_6 FlexCAN5_BUF_16_31 */
    .long   CAN5_ORed_32_63_MB_IRQHandler    /* Vector # 633 FlexCAN5_7 FlexCAN5_BUF_32_63 */
    .long   CAN5_ORed_64_95_MB_IRQHandler    /* Vector # 634 FlexCAN5_8 FlexCAN0_BUF_64_95 */
    .long   DefaultISR                       /* Vector # 635 */
    .long   DefaultISR                       /* Vector # 636 */
    .long   DefaultISR                       /* Vector # 637 */
    .long   CAN6_Error_IRQHandler            /* Vector # 638 FlexCAN6_0 FLEXCAN_6_ESR[ERR_INT] */
    .long   CAN6_ORed_IRQHandler             /* Vector # 639 FlexCAN6_1 FLEXCAN_6_ESR_BOFF | FLEXCAN_6_Transmit_Warning | FLEXCAN_6_Receive_Warning */
    .long   CAN6_ORed_00_03_MB_IRQHandler    /* Vector # 640 FlexCAN6_2 FlexCAN6_BUF_00_03 */
    .long   CAN6_ORed_04_07_MB_IRQHandler    /* Vector # 641 FlexCAN6_3 FlexCAN6_BUF_04_07 */
    .long   CAN6_ORed_08_11_MB_IRQHandler    /* Vector # 642 FlexCAN6_4 FlexCAN6_BUF_08_11 */
    .long   CAN6_ORed_12_15_MB_IRQHandler    /* Vector # 643 FlexCAN6_5 FlexCAN6_BUF_12_15 */
    .long   CAN6_ORed_16_31_MB_IRQHandler    /* Vector # 644 FlexCAN6_6 FlexCAN6_BUF_16_31 */
    .long   CAN6_ORed_32_63_MB_IRQHandler    /* Vector # 645 FlexCAN6_7 FlexCAN6_BUF_32_63 */
    .long   CAN6_ORed_64_95_MB_IRQHandler    /* Vector # 646 FlexCAN6_8 FlexCAN0_BUF_64_95 */
    .long   DefaultISR                       /* Vector # 647 */
    .long   DefaultISR                       /* Vector # 648 */
    .long   DefaultISR                       /* Vector # 649 */
    .long   CAN7_Error_IRQHandler            /* Vector # 650 FlexCAN7_0 FLEXCAN_7_ESR[ERR_INT] */
    .long   CAN7_ORed_IRQHandler             /* Vector # 651 FlexCAN7_1 FLEXCAN_7_ESR_BOFF | FLEXCAN_7_Transmit_Warning | FLEXCAN_7_Receive_Warning */
    .long   CAN7_ORed_00_03_MB_IRQHandler    /* Vector # 652 FlexCAN7_2 FlexCAN7_BUF_00_03 */
    .long   CAN7_ORed_04_07_MB_IRQHandler    /* Vector # 653 FlexCAN7_3 FlexCAN7_BUF_04_07 */
    .long   CAN7_ORed_08_11_MB_IRQHandler    /* Vector # 654 FlexCAN7_4 FlexCAN7_BUF_08_11 */
    .long   CAN7_ORed_12_15_MB_IRQHandler    /* Vector # 655 FlexCAN7_5 FlexCAN7_BUF_12_15 */
    .long   CAN7_ORed_16_31_MB_IRQHandler    /* Vector # 656 FlexCAN7_6 FlexCAN7_BUF_16_31 */
    .long   CAN7_ORed_32_63_MB_IRQHandler    /* Vector # 657 FlexCAN7_7 FlexCAN7_BUF_32_63 */
    .long   CAN7_ORed_64_95_MB_IRQHandler    /* Vector # 658 FlexCAN7_8 FlexCAN0_BUF_64_95 */
    .long   DefaultISR                       /* Vector # 659 */
    .long   DefaultISR                       /* Vector # 660 */
    .long   DefaultISR                       /* Vector # 661 */
    .long   DefaultISR                       /* Vector # 662 */
    .long   DefaultISR                       /* Vector # 663 */
    .long   DefaultISR                       /* Vector # 664 */
    .long   DefaultISR                       /* Vector # 665 */
    .long   DefaultISR                       /* Vector # 666 */
    .long   DefaultISR                       /* Vector # 667 */
    .long   WKPU_07_00_IRQHandler            /* Vector # 668 WKPU_IRQ_0 (0-7) */
    .long   WKPU_15_08_IRQHandler            /* Vector # 669 WKPU_IRQ_1 (8-15) */
    .long   WKPU_23_16_IRQHandler            /* Vector # 670 WKPU_IRQ_2 (16-23) */
    .long   WKPU_31_24_IRQHandler            /* Vector # 671 WKPU_IRQ_3 (24-31) */
    .long   DefaultISR                       /* Vector # 672 */
    .long   DefaultISR                       /* Vector # 673 */
    .long   DefaultISR                       /* Vector # 674 */
    .long   DefaultISR                       /* Vector # 675 */
    .long   DefaultISR                       /* Vector # 676 */
    .long   DefaultISR                       /* Vector # 677 */
    .long   DefaultISR                       /* Vector # 678 */
    .long   DefaultISR                       /* Vector # 679 */
    .long   uSDHC_DriverIRQHandler           /* Vector # 680 SDIO (uSDHC) 0 uSDHC0 */
    .long   DefaultISR                       /* Vector # 681 */
    .long   USBOTG_IRQHandler                /* Vector # 682 USB_OTG USB OTG */
    .long   USBHS_IRQHandler                 /* Vector # 683 USB_SPH USB SPH */
    .long   DefaultISR                       /* Vector # 684 */
    .long   DefaultISR                       /* Vector # 685 */
    .long   DefaultISR                       /* Vector # 686 MLB MLB System Interrupt */
    .long   DefaultISR                       /* Vector # 687 MLB MLB Channel Interrupts 0-15 Combined */
    .long   DefaultISR                       /* Vector # 688 */
    .long   DefaultISR                       /* Vector # 689 */
    .long   SAI0_Tx_IRQHandler               /* Vector # 690 SAI0_TX_FIFO_IRQ SAI0_TX_FIFO_IRQ */
    .long   SAI0_Rx_IRQHandler               /* Vector # 691 SAI0_RX_FIFO_IRQ SAI0_RX_FIFO_IRQ */
    .long   SAI1_Tx_IRQHandler               /* Vector # 692 SAI1_TX_FIFO_IRQ SAI1_TX_FIFO_IRQ */
    .long   SAI1_Rx_IRQHandler               /* Vector # 693 SAI1_RX_FIFO_IRQ SAI1_RX_FIFO_IRQ */
    .long   SAI2_Tx_IRQHandler               /* Vector # 694 SAI2_TX_FIFO_IRQ SAI2_TX_FIFO_IRQ */
    .long   SAI2_Rx_IRQHandler               /* Vector # 695 SAI2_RX_FIFO_IRQ SAI2_RX_FIFO_IRQ */
    .long   DefaultISR                       /* Vector # 696 */
    .long   DefaultISR                       /* Vector # 697 */
    .long   DefaultISR                       /* Vector # 698 */
    .long   DefaultISR                       /* Vector # 699 */
    .long   DefaultISR                       /* Vector # 700 */
    .long   DefaultISR                       /* Vector # 701 JDC JDC */
    .long   DefaultISR                       /* Vector # 702 MEMU_1 Correctable errors in LPU mode */
    .long   DefaultISR                       /* Vector # 703 */
    .long   DefaultISR                       /* Vector # 704 */
    .long   DefaultISR                       /* Vector # 705 */
    .long   EMIOS0_00_01_IRQHandler          /* Vector # 706 eMIOS channel 0,1 EMIOS_GFR[F0,F1] */
    .long   EMIOS0_02_03_IRQHandler          /* Vector # 707 eMIOS channel 2,3 EMIOS_GFR[F2,F3] */
    .long   EMIOS0_04_05_IRQHandler          /* Vector # 708 eMIOS channel 4,5 EMIOS_GFR[F4,F5] */
    .long   EMIOS0_06_07_IRQHandler          /* Vector # 709 eMIOS channel 6,7 EMIOS_GFR[F6,F7] */
    .long   EMIOS0_08_09_IRQHandler          /* Vector # 710 eMIOS channel 8,9 EMIOS_GFR[F8,F9] */
    .long   EMIOS0_10_11_IRQHandler          /* Vector # 711 eMIOS channel 10,11 EMIOS_GFR[F10,F11] */
    .long   EMIOS0_12_13_IRQHandler          /* Vector # 712 eMIOS channel 12,13 EMIOS_GFR[F12,F13] */
    .long   EMIOS0_14_15_IRQHandler          /* Vector # 713 eMIOS channel 14,15 EMIOS_GFR[F14,F15] */
    .long   EMIOS0_16_17_IRQHandler          /* Vector # 714 eMIOS channel 16,17 EMIOS_GFR[F16,F17] */
    .long   EMIOS0_18_19_IRQHandler          /* Vector # 715 eMIOS channel 18,19 EMIOS_GFR[F18,F19] */
    .long   EMIOS0_20_21_IRQHandler          /* Vector # 716 eMIOS channel 20,21 EMIOS_GFR[F20,F21] */
    .long   EMIOS0_22_23_IRQHandler          /* Vector # 717 eMIOS channel 22,23 EMIOS_GFR[F22,F23] */
    .long   EMIOS0_24_25_IRQHandler          /* Vector # 718 eMIOS channel 24,25 EMIOS_GFR[F24,F25] */
    .long   EMIOS0_26_27_IRQHandler          /* Vector # 719 eMIOS channel 26,27 EMIOS_GFR[F26,F27] */
    .long   EMIOS0_28_29_IRQHandler          /* Vector # 720 eMIOS channel 28,29 EMIOS_GFR[F28,F29] */
    .long   EMIOS0_30_31_IRQHandler          /* Vector # 721 eMIOS channel 30,31 EMIOS_GFR[F30,F31] */
    .long   EMIOS1_00_01_IRQHandler          /* Vector # 722 eMIOS channel 32,33 EMIOS_GFR[F32,F33] */
    .long   EMIOS1_02_03_IRQHandler          /* Vector # 723 eMIOS channel 34,35 EMIOS_GFR[F34,F35] */
    .long   EMIOS1_04_05_IRQHandler          /* Vector # 724 eMIOS channel 36,37 EMIOS_GFR[F36,F37] */
    .long   EMIOS1_06_07_IRQHandler          /* Vector # 725 eMIOS channel 38,39 EMIOS_GFR[F38,F39] */
    .long   EMIOS1_08_09_IRQHandler          /* Vector # 726 eMIOS channel 40,41 EMIOS_GFR[F40,F41] */
    .long   EMIOS1_10_11_IRQHandler          /* Vector # 727 eMIOS channel 42,43 EMIOS_GFR[F42,F43] */
    .long   EMIOS1_12_13_IRQHandler          /* Vector # 728 eMIOS channel 44,45 EMIOS_GFR[F44,F45] */
    .long   EMIOS1_14_15_IRQHandler          /* Vector # 729 eMIOS channel 46,47 EMIOS_GFR[F46,F47] */
    .long   EMIOS1_16_17_IRQHandler          /* Vector # 730 eMIOS channel 48,49 EMIOS_GFR[F48,F49] */
    .long   EMIOS1_18_19_IRQHandler          /* Vector # 731 eMIOS channel 50,51 EMIOS_GFR[F50,F51] */
    .long   EMIOS1_20_21_IRQHandler          /* Vector # 732 eMIOS channel 52,53 EMIOS_GFR[F52,F53] */
    .long   EMIOS1_22_23_IRQHandler          /* Vector # 733 eMIOS channel 54,55 EMIOS_GFR[F54,F55] */
    .long   EMIOS1_24_25_IRQHandler          /* Vector # 734 eMIOS channel 56,57 EMIOS_GFR[F56,F57] */
    .long   EMIOS1_26_27_IRQHandler          /* Vector # 735 eMIOS channel 58,59 EMIOS_GFR[F58,F59] */
    .long   EMIOS1_28_29_IRQHandler          /* Vector # 736 eMIOS channel 60,61 EMIOS_GFR[F60,F61] */
    .long   EMIOS1_30_31_IRQHandler          /* Vector # 737 eMIOS channel 62,63 EMIOS_GFR[F62,F63] */
    .long   EMIOS2_00_01_IRQHandler          /* Vector # 738 eMIOS channel 64,65 EMIOS_GFR[F64,F65] */
    .long   EMIOS2_02_03_IRQHandler          /* Vector # 739 eMIOS channel 66,67 EMIOS_GFR[F66,F67] */
    .long   EMIOS2_04_05_IRQHandler          /* Vector # 740 eMIOS channel 68,69 EMIOS_GFR[F68,F69] */
    .long   EMIOS2_06_07_IRQHandler          /* Vector # 741 eMIOS channel 70,71 EMIOS_GFR[F70,F71] */
    .long   EMIOS2_08_09_IRQHandler          /* Vector # 742 eMIOS channel 72,73 EMIOS_GFR[F72,F73] */
    .long   EMIOS2_10_11_IRQHandler          /* Vector # 743 eMIOS channel 74,75 EMIOS_GFR[F74,F75] */
    .long   EMIOS2_12_13_IRQHandler          /* Vector # 744 eMIOS channel 76,77 EMIOS_GFR[F76,F77] */
    .long   EMIOS2_14_15_IRQHandler          /* Vector # 745 eMIOS channel 78,79 EMIOS_GFR[F78,F79] */
    .long   EMIOS2_16_17_IRQHandler          /* Vector # 746 eMIOS channel 80,81 EMIOS_GFR[F80,F81] */
    .long   EMIOS2_18_19_IRQHandler          /* Vector # 747 eMIOS channel 82,83 EMIOS_GFR[F82,F83] */
    .long   EMIOS2_20_21_IRQHandler          /* Vector # 748 eMIOS channel 84,85 EMIOS_GFR[F84,F85] */
    .long   EMIOS2_22_23_IRQHandler          /* Vector # 749 eMIOS channel 86,87 EMIOS_GFR[F86,F87] */
    .long   EMIOS2_24_25_IRQHandler          /* Vector # 750 eMIOS channel 88,89 EMIOS_GFR[F88,F89] */
    .long   EMIOS2_26_27_IRQHandler          /* Vector # 751 eMIOS channel 90,91 EMIOS_GFR[F90,F91] */
    .long   EMIOS2_28_29_IRQHandler          /* Vector # 752 eMIOS channel 92,93 EMIOS_GFR[F92,F93] */
    .long   EMIOS2_30_31_IRQHandler          /* Vector # 753 eMIOS channel 94,95 EMIOS_GFR[F94,F95] */

    .align  2
    .weak IVOR0_Handler
    .type IVOR0_Handler, %function
IVOR0_Handler:
    e_b       IVOR0_Handler
    .size IVOR0_Handler, . - IVOR0_Handler

    .align  2
    .weak IVOR1_Handler
    .type IVOR1_Handler, %function
IVOR1_Handler:
    e_b       IVOR1_Handler
    .size IVOR1_Handler, . - IVOR1_Handler

    .align  2
    .weak IVOR2_Handler
    .type IVOR2_Handler, %function
IVOR2_Handler:
    e_b       IVOR2_Handler
    .size IVOR2_Handler, . - IVOR2_Handler

    .align  2
    .weak IVOR3_Handler
    .type IVOR3_Handler, %function
IVOR3_Handler:
    e_b       IVOR3_Handler
    .size IVOR3_Handler, . - IVOR3_Handler

    .align  2
    .weak IVOR4_Handler
    .type IVOR4_Handler, %function
IVOR4_Handler:
    e_b       IVOR4_Handler
    .size IVOR4_Handler, . - IVOR4_Handler

    .align  2
    .weak IVOR5_Handler
    .type IVOR5_Handler, %function
IVOR5_Handler:
    e_b       IVOR5_Handler
    .size IVOR5_Handler, . - IVOR5_Handler

    .align  2
    .weak IVOR6_Handler
    .type IVOR6_Handler, %function
IVOR6_Handler:
    e_b       IVOR6_Handler
    .size IVOR6_Handler, . - IVOR6_Handler

    .align  2
    .weak IVOR7_Handler
    .type IVOR7_Handler, %function
IVOR7_Handler:
    e_b       IVOR7_Handler
    .size IVOR7_Handler, . - IVOR7_Handler

    .align  2
    .weak IVOR8_Handler
    .type IVOR8_Handler, %function
IVOR8_Handler:
    e_b       IVOR8_Handler
    .size IVOR8_Handler, . - IVOR8_Handler

    .align  2
    .weak IVOR9_Handler
    .type IVOR9_Handler, %function
IVOR9_Handler:
    e_b       IVOR9_Handler
    .size IVOR9_Handler, . - IVOR9_Handler

    .align  2
    .weak IVOR10_Handler
    .type IVOR10_Handler, %function
IVOR10_Handler:
    e_b       IVOR10_Handler
    .size IVOR10_Handler, . - IVOR10_Handler

    .align  2
    .weak IVOR11_Handler
    .type IVOR11_Handler, %function
IVOR11_Handler:
    e_b       IVOR11_Handler
    .size IVOR11_Handler, . - IVOR11_Handler

    .align  2
    .weak IVOR12_Handler
    .type IVOR12_Handler, %function
IVOR12_Handler:
    e_b       IVOR12_Handler
    .size IVOR12_Handler, . - IVOR12_Handler

    .align  2
    .weak IVOR13_Handler
    .type IVOR13_Handler, %function
IVOR13_Handler:
    e_b       IVOR13_Handler
    .size IVOR13_Handler, . - IVOR13_Handler

    .align  2
    .weak IVOR14_Handler
    .type IVOR14_Handler, %function
IVOR14_Handler:
    e_b       IVOR14_Handler
    .size IVOR14_Handler, . - IVOR14_Handler

    .align  2
    .weak IVOR15_Handler
    .type IVOR15_Handler, %function
IVOR15_Handler:
    e_b       IVOR15_Handler
    .size IVOR15_Handler, . - IVOR15_Handler

    .align  2
    .weak DefaultISR
    .type DefaultISR, %function
DefaultISR:
    e_b       DefaultISR
    .size DefaultISR, . - DefaultISR

