FARLY7/xcan-router/ECU_Cluster_01/ECU_Cluster_01_Z4_0/Project_Settings/Startup_Code/startup_MPC5748G.S
/*    Macro to define default handlers. Default handler
 *    will be weak symbol and just dead loops. They can be
 *    overwritten by other handlers */
    .macro def_irq_handler  handler_name
    .weak \handler_name
    .set  \handler_name, DefaultISR
    .endm

/* NMI Exception Handlers */
    def_irq_handler    IVOR1_Exception_Handler

/* System call Handler */
    def_irq_handler    IVOR8_Exception_Handler

/* Exception Handlers */
    def_irq_handler    DMA_Error_IRQHandler
    def_irq_handler    DMA0_IRQHandler
    def_irq_handler    DMA1_IRQHandler
    def_irq_handler    DMA2_IRQHandler
    def_irq_handler    DMA3_IRQHandler
    def_irq_handler    DMA4_IRQHandler
    def_irq_handler    DMA5_IRQHandler
    def_irq_handler    DMA6_IRQHandler
    def_irq_handler    DMA7_IRQHandler
    def_irq_handler    DMA8_IRQHandler
    def_irq_handler    DMA9_IRQHandler
    def_irq_handler    DMA10_IRQHandler
    def_irq_handler    DMA11_IRQHandler
    def_irq_handler    DMA12_IRQHandler
    def_irq_handler    DMA13_IRQHandler
    def_irq_handler    DMA14_IRQHandler
    def_irq_handler    DMA15_IRQHandler
    def_irq_handler    DMA16_IRQHandler
    def_irq_handler    DMA17_IRQHandler
    def_irq_handler    DMA18_IRQHandler
    def_irq_handler    DMA19_IRQHandler
    def_irq_handler    DMA20_IRQHandler
    def_irq_handler    DMA21_IRQHandler
    def_irq_handler    DMA22_IRQHandler
    def_irq_handler    DMA23_IRQHandler
    def_irq_handler    DMA24_IRQHandler
    def_irq_handler    DMA25_IRQHandler
    def_irq_handler    DMA26_IRQHandler
    def_irq_handler    DMA27_IRQHandler
    def_irq_handler    DMA28_IRQHandler
    def_irq_handler    DMA29_IRQHandler
    def_irq_handler    DMA30_IRQHandler
    def_irq_handler    DMA31_IRQHandler
    def_irq_handler    FLASH_Done_IRQHandler
    def_irq_handler    ENET1_Err_IRQHandler
    def_irq_handler    ENET1_Rx_IRQHandler
    def_irq_handler    ENET1_Tx_IRQHandler
    def_irq_handler    ENET1_Parser_IRQHandler
    def_irq_handler    ENET1_Timer_IRQHandler
    def_irq_handler    ENET1_Rx_1_IRQHandler
    def_irq_handler    ENET1_Tx_1_IRQHandler
    def_irq_handler    ENET1_Rx_2_IRQHandler
    def_irq_handler    ENET1_Tx_2_IRQHandler
    def_irq_handler    ENET0_Err_IRQHandler
    def_irq_handler    ENET0_Rx_IRQHandler
    def_irq_handler    ENET0_Tx_IRQHandler
    def_irq_handler    ENET0_Parser_IRQHandler
    def_irq_handler    ENET0_Timer_IRQHandler
    def_irq_handler    ENET0_Rx_1_IRQHandler
    def_irq_handler    ENET0_Tx_1_IRQHandler
    def_irq_handler    ENET0_Rx_2_IRQHandler
    def_irq_handler    ENET0_Tx_2_IRQHandler
    def_irq_handler    RTC0_IRQHandler
    def_irq_handler    API0_IRQHandler
    def_irq_handler    I2C_DRV_Module0IRQHandler
    def_irq_handler    I2C_DRV_Module1IRQHandler
    def_irq_handler    I2C_DRV_Module2IRQHandler
    def_irq_handler    I2C_DRV_Module3IRQHandler
    def_irq_handler    CAN0_Wake_Up_IRQHandler
    def_irq_handler    CAN0_Error_IRQHandler
    def_irq_handler    CAN0_ORed_IRQHandler
    def_irq_handler    CAN0_ORed_00_03_MB_IRQHandler
    def_irq_handler    CAN0_ORed_04_07_MB_IRQHandler
    def_irq_handler    CAN0_ORed_08_11_MB_IRQHandler
    def_irq_handler    CAN0_ORed_12_15_MB_IRQHandler
    def_irq_handler    CAN0_ORed_16_31_MB_IRQHandler
    def_irq_handler    CAN0_ORed_32_63_MB_IRQHandler
    def_irq_handler    CAN0_ORed_64_95_MB_IRQHandler
    def_irq_handler    CAN1_Error_IRQHandler
    def_irq_handler    CAN1_ORed_IRQHandler
    def_irq_handler    CAN1_ORed_00_03_MB_IRQHandler
    def_irq_handler    CAN1_ORed_04_07_MB_IRQHandler
    def_irq_handler    CAN1_ORed_08_11_MB_IRQHandler
    def_irq_handler    CAN1_ORed_12_15_MB_IRQHandler
    def_irq_handler    CAN1_ORed_16_31_MB_IRQHandler
    def_irq_handler    CAN1_ORed_32_63_MB_IRQHandler
    def_irq_handler    CAN1_ORed_64_95_MB_IRQHandler
    def_irq_handler    CAN2_Error_IRQHandler
    def_irq_handler    CAN2_ORed_IRQHandler
    def_irq_handler    CAN2_ORed_00_03_MB_IRQHandler
    def_irq_handler    CAN2_ORed_04_07_MB_IRQHandler
    def_irq_handler    CAN2_ORed_08_11_MB_IRQHandler
    def_irq_handler    CAN2_ORed_12_15_MB_IRQHandler
    def_irq_handler    CAN2_ORed_16_31_MB_IRQHandler
    def_irq_handler    CAN2_ORed_32_63_MB_IRQHandler
    def_irq_handler    CAN2_ORed_64_95_MB_IRQHandler
    def_irq_handler    CAN3_Error_IRQHandler
    def_irq_handler    CAN3_ORed_IRQHandler
    def_irq_handler    CAN3_ORed_00_03_MB_IRQHandler
    def_irq_handler    CAN3_ORed_04_07_MB_IRQHandler
    def_irq_handler    CAN3_ORed_08_11_MB_IRQHandler
    def_irq_handler    CAN3_ORed_12_15_MB_IRQHandler
    def_irq_handler    CAN3_ORed_16_31_MB_IRQHandler
    def_irq_handler    CAN3_ORed_32_63_MB_IRQHandler
    def_irq_handler    CAN3_ORed_64_95_MB_IRQHandler
    def_irq_handler    CAN4_Error_IRQHandler
    def_irq_handler    CAN4_ORed_IRQHandler
    def_irq_handler    CAN4_ORed_00_03_MB_IRQHandler
    def_irq_handler    CAN4_ORed_04_07_MB_IRQHandler
    def_irq_handler    CAN4_ORed_08_11_MB_IRQHandler
    def_irq_handler    CAN4_ORed_12_15_MB_IRQHandler
    def_irq_handler    CAN4_ORed_16_31_MB_IRQHandler
    def_irq_handler    CAN4_ORed_32_63_MB_IRQHandler
    def_irq_handler    CAN4_ORed_64_95_MB_IRQHandler
    def_irq_handler    CAN5_Error_IRQHandler
    def_irq_handler    CAN5_ORed_IRQHandler
    def_irq_handler    CAN5_ORed_00_03_MB_IRQHandler
    def_irq_handler    CAN5_ORed_04_07_MB_IRQHandler
    def_irq_handler    CAN5_ORed_08_11_MB_IRQHandler
    def_irq_handler    CAN5_ORed_12_15_MB_IRQHandler
    def_irq_handler    CAN5_ORed_16_31_MB_IRQHandler
    def_irq_handler    CAN5_ORed_32_63_MB_IRQHandler
    def_irq_handler    CAN5_ORed_64_95_MB_IRQHandler
    def_irq_handler    CAN6_Error_IRQHandler
    def_irq_handler    CAN6_ORed_IRQHandler
    def_irq_handler    CAN6_ORed_00_03_MB_IRQHandler
    def_irq_handler    CAN6_ORed_04_07_MB_IRQHandler
    def_irq_handler    CAN6_ORed_08_11_MB_IRQHandler
    def_irq_handler    CAN6_ORed_12_15_MB_IRQHandler
    def_irq_handler    CAN6_ORed_16_31_MB_IRQHandler
    def_irq_handler    CAN6_ORed_32_63_MB_IRQHandler
    def_irq_handler    CAN6_ORed_64_95_MB_IRQHandler
    def_irq_handler    CAN7_Error_IRQHandler
    def_irq_handler    CAN7_ORed_IRQHandler
    def_irq_handler    CAN7_ORed_00_03_MB_IRQHandler
    def_irq_handler    CAN7_ORed_04_07_MB_IRQHandler
    def_irq_handler    CAN7_ORed_08_11_MB_IRQHandler
    def_irq_handler    CAN7_ORed_12_15_MB_IRQHandler
    def_irq_handler    CAN7_ORed_16_31_MB_IRQHandler
    def_irq_handler    CAN7_ORed_32_63_MB_IRQHandler
    def_irq_handler    CAN7_ORed_64_95_MB_IRQHandler
    def_irq_handler    SWT0_IRQHandler
    def_irq_handler    SWT1_IRQHandler
    def_irq_handler    SWT2_IRQHandler
    def_irq_handler    WKPU_07_00_IRQHandler
    def_irq_handler    WKPU_15_08_IRQHandler
    def_irq_handler    WKPU_23_16_IRQHandler
    def_irq_handler    WKPU_31_24_IRQHandler
    def_irq_handler    STM0_Ch0_IRQHandler
    def_irq_handler    STM0_Ch1_IRQHandler
    def_irq_handler    STM0_Ch2_IRQHandler
    def_irq_handler    STM0_Ch3_IRQHandler
    def_irq_handler    STM1_Ch0_IRQHandler
    def_irq_handler    STM1_Ch1_IRQHandler
    def_irq_handler    STM1_Ch2_IRQHandler
    def_irq_handler    STM1_Ch3_IRQHandler
    def_irq_handler    STM2_Ch0_IRQHandler
    def_irq_handler    STM2_Ch1_IRQHandler
    def_irq_handler    STM2_Ch2_IRQHandler
    def_irq_handler    STM2_Ch3_IRQHandler
    def_irq_handler    PIT_Ch0_IRQHandler
    def_irq_handler    PIT_Ch1_IRQHandler
    def_irq_handler    PIT_Ch2_IRQHandler
    def_irq_handler    PIT_Ch3_IRQHandler
    def_irq_handler    PIT_Ch4_IRQHandler
    def_irq_handler    PIT_Ch5_IRQHandler
    def_irq_handler    PIT_Ch6_IRQHandler
    def_irq_handler    PIT_Ch7_IRQHandler
    def_irq_handler    PIT_Ch8_IRQHandler
    def_irq_handler    PIT_Ch9_IRQHandler
    def_irq_handler    PIT_Ch10_IRQHandler
    def_irq_handler    PIT_Ch11_IRQHandler
    def_irq_handler    PIT_Ch12_IRQHandler
    def_irq_handler    PIT_Ch13_IRQHandler
    def_irq_handler    PIT_Ch14_IRQHandler
    def_irq_handler    PIT_Ch15_IRQHandler
    def_irq_handler    PIT_RTI_IRQHandler
    def_irq_handler    BCTU_ListLast_IRQHandler
    def_irq_handler    BCTU_ConvUpdate_IRQHandler
    def_irq_handler    LINFLEXD0_UART_RxIRQHandler
    def_irq_handler    LINFLEXD0_UART_TxIRQHandler
    def_irq_handler    LINFLEXD0_UART_ErrIRQHandler
    def_irq_handler    LINFLEXD1_UART_RxIRQHandler
    def_irq_handler    LINFLEXD1_UART_TxIRQHandler
    def_irq_handler    LINFLEXD1_UART_ErrIRQHandler
    def_irq_handler    LINFLEXD2_UART_RxIRQHandler
    def_irq_handler    LINFLEXD2_UART_TxIRQHandler
    def_irq_handler    LINFLEXD2_UART_ErrIRQHandler
    def_irq_handler    LINFLEXD3_UART_RxIRQHandler
    def_irq_handler    LINFLEXD3_UART_TxIRQHandler
    def_irq_handler    LINFLEXD3_UART_ErrIRQHandler
    def_irq_handler    LINFLEXD4_UART_RxIRQHandler
    def_irq_handler    LINFLEXD4_UART_TxIRQHandler
    def_irq_handler    LINFLEXD4_UART_ErrIRQHandler
    def_irq_handler    LINFLEXD5_UART_RxIRQHandler
    def_irq_handler    LINFLEXD5_UART_TxIRQHandler
    def_irq_handler    LINFLEXD5_UART_ErrIRQHandler
    def_irq_handler    LINFLEXD6_UART_RxIRQHandler
    def_irq_handler    LINFLEXD6_UART_TxIRQHandler
    def_irq_handler    LINFLEXD6_UART_ErrIRQHandler
    def_irq_handler    LINFLEXD7_UART_RxIRQHandler
    def_irq_handler    LINFLEXD7_UART_TxIRQHandler
    def_irq_handler    LINFLEXD7_UART_ErrIRQHandler
    def_irq_handler    LINFLEXD8_UART_RxIRQHandler
    def_irq_handler    LINFLEXD8_UART_TxIRQHandler
    def_irq_handler    LINFLEXD8_UART_ErrIRQHandler
    def_irq_handler    LINFLEXD9_UART_RxIRQHandler
    def_irq_handler    LINFLEXD9_UART_TxIRQHandler
    def_irq_handler    LINFLEXD9_UART_ErrIRQHandler
    def_irq_handler    LINFLEXD10_UART_RxIRQHandler
    def_irq_handler    LINFLEXD10_UART_TxIRQHandler
    def_irq_handler    LINFLEXD10_UART_ErrIRQHandler
    def_irq_handler    LINFLEXD11_UART_RxIRQHandler
    def_irq_handler    LINFLEXD11_UART_TxIRQHandler
    def_irq_handler    LINFLEXD11_UART_ErrIRQHandler
    def_irq_handler    LINFLEXD12_UART_RxIRQHandler
    def_irq_handler    LINFLEXD12_UART_TxIRQHandler
    def_irq_handler    LINFLEXD12_UART_ErrIRQHandler
    def_irq_handler    LINFLEXD13_UART_RxIRQHandler
    def_irq_handler    LINFLEXD13_UART_TxIRQHandler
    def_irq_handler    LINFLEXD13_UART_ErrIRQHandler
    def_irq_handler    LINFLEXD14_UART_RxIRQHandler
    def_irq_handler    LINFLEXD14_UART_TxIRQHandler
    def_irq_handler    LINFLEXD14_UART_ErrIRQHandler
    def_irq_handler    LINFLEXD15_UART_RxIRQHandler
    def_irq_handler    LINFLEXD15_UART_TxIRQHandler
    def_irq_handler    LINFLEXD15_UART_ErrIRQHandler
    def_irq_handler    LINFLEXD16_UART_RxIRQHandler
    def_irq_handler    LINFLEXD16_UART_TxIRQHandler
    def_irq_handler    LINFLEXD16_UART_ErrIRQHandler
    def_irq_handler    LINFLEXD17_UART_RxIRQHandler
    def_irq_handler    LINFLEXD17_UART_TxIRQHandler
    def_irq_handler    LINFLEXD17_UART_ErrIRQHandler
    def_irq_handler    DSPI0_FIFO_Error_IRQHandler
    def_irq_handler    DSPI0_Send_IRQHandler
    def_irq_handler    DSPI0_Receive_IRQHandler
    def_irq_handler    DSPI1_FIFO_Error_IRQHandler
    def_irq_handler    DSPI1_Send_IRQHandler
    def_irq_handler    DSPI1_Receive_IRQHandler
    def_irq_handler    DSPI2_FIFO_Error_IRQHandler
    def_irq_handler    DSPI2_Send_IRQHandler
    def_irq_handler    DSPI2_Receive_IRQHandler
    def_irq_handler    DSPI3_FIFO_Error_IRQHandler
    def_irq_handler    DSPI3_Send_IRQHandler
    def_irq_handler    DSPI3_Receive_IRQHandler
    def_irq_handler    DSPI4_FIFO_Error_IRQHandler
    def_irq_handler    DSPI4_Send_IRQHandler
    def_irq_handler    DSPI4_Receive_IRQHandler
    def_irq_handler    DSPI5_FIFO_Error_IRQHandler
    def_irq_handler    DSPI5_Send_IRQHandler
    def_irq_handler    DSPI5_Receive_IRQHandler
    def_irq_handler    DSPI6_FIFO_Error_IRQHandler
    def_irq_handler    DSPI6_Send_IRQHandler
    def_irq_handler    DSPI6_Receive_IRQHandler
    def_irq_handler    DSPI7_FIFO_Error_IRQHandler
    def_irq_handler    DSPI7_Send_IRQHandler
    def_irq_handler    DSPI7_Receive_IRQHandler
    def_irq_handler    DSPI8_FIFO_Error_IRQHandler
    def_irq_handler    DSPI8_Send_IRQHandler
    def_irq_handler    DSPI8_Receive_IRQHandler
    def_irq_handler    DSPI9_FIFO_Error_IRQHandler
    def_irq_handler    DSPI9_Send_IRQHandler
    def_irq_handler    DSPI9_Receive_IRQHandler
    def_irq_handler    ADC0_EOC_IRQHandler
    def_irq_handler    ADC0_ER_IRQHandler
    def_irq_handler    ADC0_WD_IRQHandler
    def_irq_handler    ADC1_EOC_IRQHandler
    def_irq_handler    ADC1_ER_IRQHandler
    def_irq_handler    ADC1_WD_IRQHandler
    def_irq_handler    uSDHC_DriverIRQHandler
    def_irq_handler    FCCU0_IRQ_Handler
    def_irq_handler    SAI0_Tx_IRQHandler
    def_irq_handler    SAI0_Rx_IRQHandler
    def_irq_handler    SAI1_Tx_IRQHandler
    def_irq_handler    SAI1_Rx_IRQHandler
    def_irq_handler    SAI2_Tx_IRQHandler
    def_irq_handler    SAI2_Rx_IRQHandler
    def_irq_handler    CMP0_IRQHandler
    def_irq_handler    CMP1_IRQHandler
    def_irq_handler    CMP2_IRQHandler
    def_irq_handler    HSM_DRV_IRQHandler
    def_irq_handler    SIUL_EIRQ_00_07_IRQHandler
    def_irq_handler    SIUL_EIRQ_08_15_IRQHandler
    def_irq_handler    SIUL_EIRQ_16_23_IRQHandler
    def_irq_handler    SIUL_EIRQ_24_31_IRQHandler
    def_irq_handler    EMIOS0_00_01_IRQHandler
    def_irq_handler    EMIOS0_02_03_IRQHandler
    def_irq_handler    EMIOS0_04_05_IRQHandler
    def_irq_handler    EMIOS0_06_07_IRQHandler
    def_irq_handler    EMIOS0_08_09_IRQHandler
    def_irq_handler    EMIOS0_10_11_IRQHandler
    def_irq_handler    EMIOS0_12_13_IRQHandler
    def_irq_handler    EMIOS0_14_15_IRQHandler
    def_irq_handler    EMIOS0_16_17_IRQHandler
    def_irq_handler    EMIOS0_18_19_IRQHandler
    def_irq_handler    EMIOS0_20_21_IRQHandler
    def_irq_handler    EMIOS0_22_23_IRQHandler
    def_irq_handler    EMIOS0_24_25_IRQHandler
    def_irq_handler    EMIOS0_26_27_IRQHandler
    def_irq_handler    EMIOS0_28_29_IRQHandler
    def_irq_handler    EMIOS0_30_31_IRQHandler
    def_irq_handler    EMIOS1_00_01_IRQHandler
    def_irq_handler    EMIOS1_02_03_IRQHandler
    def_irq_handler    EMIOS1_04_05_IRQHandler
    def_irq_handler    EMIOS1_06_07_IRQHandler
    def_irq_handler    EMIOS1_08_09_IRQHandler
    def_irq_handler    EMIOS1_10_11_IRQHandler
    def_irq_handler    EMIOS1_12_13_IRQHandler
    def_irq_handler    EMIOS1_14_15_IRQHandler
    def_irq_handler    EMIOS1_16_17_IRQHandler
    def_irq_handler    EMIOS1_18_19_IRQHandler
    def_irq_handler    EMIOS1_20_21_IRQHandler
    def_irq_handler    EMIOS1_22_23_IRQHandler
    def_irq_handler    EMIOS1_24_25_IRQHandler
    def_irq_handler    EMIOS1_26_27_IRQHandler
    def_irq_handler    EMIOS1_28_29_IRQHandler
    def_irq_handler    EMIOS1_30_31_IRQHandler
    def_irq_handler    EMIOS2_00_01_IRQHandler
    def_irq_handler    EMIOS2_02_03_IRQHandler
    def_irq_handler    EMIOS2_04_05_IRQHandler
    def_irq_handler    EMIOS2_06_07_IRQHandler
    def_irq_handler    EMIOS2_08_09_IRQHandler
    def_irq_handler    EMIOS2_10_11_IRQHandler
    def_irq_handler    EMIOS2_12_13_IRQHandler
    def_irq_handler    EMIOS2_14_15_IRQHandler
    def_irq_handler    EMIOS2_16_17_IRQHandler
    def_irq_handler    EMIOS2_18_19_IRQHandler
    def_irq_handler    EMIOS2_20_21_IRQHandler
    def_irq_handler    EMIOS2_22_23_IRQHandler
    def_irq_handler    EMIOS2_24_25_IRQHandler
    def_irq_handler    EMIOS2_26_27_IRQHandler
    def_irq_handler    EMIOS2_28_29_IRQHandler
    def_irq_handler    EMIOS2_30_31_IRQHandler
    def_irq_handler    USBHS_IRQHandler
    def_irq_handler    USBOTG_IRQHandler
